{"feedContents":[{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/32oVtOpyI0e0YSI9H4kLvb5Mlvw","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"How the AWS Lambda Hackathon let me stress test an idea that ended up transforming how I work with Q CLI to develop software.\n\nThis post is based on a presentation at AWS Community Day 2025, New Zealand, Aotearoa.","heroImageUrl":"https://prod-assets.cosmic.aws.dev/a/32oltjNq32Kkee82OS0fbzbGjmO/Micr.webp","tags":["amazon-q","amazon-q-developer","agentic-ai","gen-ai","strands-agents"],"versionId":"32qb6RH124V5zZhekGa3WiKZZkY"}},"createdAt":1758150873672,"isLiked":false,"lastModifiedAt":1758150914634,"lastPublishedAt":1758150848277,"likesCount":0,"markdownDescription":"## The Hypothesis That Changed Everything\n\nWhat if you could build 100% of a digital product's code using only Amazon Q CLI? This wasn't just theoretical curiosity—it was the driving hypothesis behind my entry into the AWS Lambda Hackathon in June 2025. The result was CodeRipple, a complete documentation automation platform built entirely through AI-assisted development.\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/32ogRZy7VlPJG9NPP6vsVmq7zH0/Fram.webp?imgSize=1000x525\" caption=\"Hackathons like AWS Lambda are among the best environments to test new ideas.\" />\n\nBut this story isn't just about a hackathon project. It's about discovering a way of working that fundamentally transforms how we approach software development in the age of AI.\n\n## The Documentation Tax\n\nBefore diving into how CodeRipple works, let's acknowledge a silent challenge plaguing every software project: documentation decay. Consider the GCC project—one of the most important compiler projects in computing history. While code changes happen daily, the README file hasn't been updated in 13 years.\n\nThis pattern repeats across countless projects. We write code, ship features, fix bugs, but documentation remains frozen in time. CodeRipple was born from a simple premise: what if documentation could update itself automatically, staying in sync with your codebase without human intervention?\n\n## Introducing CodeRipple: Documentation That Never Gets Stale\n\nCodeRipple is an event-driven application that automatically generates and updates documentation whenever you commit code. Here's how it works:\n\n**The Flow:**\n\n1. You commit code to your GitHub repository\n2. A webhook triggers CodeRipple's API endpoint\n3. The \"Receptionist\" Lambda checks out your code and stores it in S3 (the \"Drawer\")\n4. The \"Analyst\" Lambda uses Strands Agents and Claude Foundation Model on Bedrock to analyze the source code\n5. AI-generated documentation is created, including descriptions, usage guides, and ASCII architecture diagrams\n6. The \"Deliverer\" Lambda publishes the documentation to a static website.&#x20;\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/32og5C4D7mA47EtEexlYNOm5saV/Fram.webp?imgSize=1000x525\" caption=\"Documentation generated with CodeRipple\" />\n\nThe result? A continuously updated catalog of project documentation that reflects your actual codebase, not what it looked like six months ago.\n\nTo learn more about CodeRipple visit [CodeRipple's git repository](https://github.com/robertoallende/coderipple).\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/32ofPR6ItXwuo5gaGeiMoSVP5kJ/Fram.webp?imgSize=1000x525\" caption=\"CodeRipple: an event drive app that generates documentation automatically \" />\n\n## The New Abstraction Layer: Natural Language as Code\n\nTo understand the significance of what's happening here, we need to step back and consider software development's evolution. Martin Fowler recently described Generative AI as a new abstraction layer enabling interaction with computers through natural language.\n\nWe've progressed from punch cards to assembly language to high-level programming languages. Each abstraction layer made programming more accessible and productive. Now, with Large Language Models, we can write instructions in natural language—but this comes with unique challenges.\n\n* **The Non-Deterministic Challenge:** Ask ChatGPT \"what time is it?\" multiple times, and you'll get different responses. Unlike traditional code, AI responses aren't perfectly predictable.\n* **The Curse of Knowledge:** Because we're communicating in natural language, the meaning of our words carries implicit assumptions. What seems obvious to us might be completely unclear to the AI, leading to hallucinations or unexpected outputs.\n* **The Spiral of Errors:** When you encounter an error and ask AI to fix it, you might get another error. Attempt to fix that, and you might spiral into an increasingly problematic state, far from your original goal.\n\n## Introducing Micromanage-Driven Development (MMDD)\n\nTo address these challenges, I developed what I call Micromanage-Driven Development (MMDD). The name is intentionally provocative—while micromanagement is counterproductive with humans, it's exactly what AI needs to deliver reliable results.\n\nMMDD rests on three core principles:\n\n1. **Every Decision Goes Through Me**\n   I maintain constant conversation with the AI, making all architectural and implementation decisions explicit. The AI executes, but I guide every step.\n2. **Documentation Holds the World Together**\n   Every decision, context, and plan gets written into files. This creates a knowledge base that can be referenced throughout the project, ensuring consistency and enabling recovery from mistakes.\n3. **Small Steps, Big Results**\n   I make one small change at a time. Big changes lead to hallucinations and disasters. By constraining scope, I maintain control and can easily backtrack when needed.\n\n## The MMDD Workflow in Action\n\nHere's how MMDD works in practice for a project like CodeRipple:\n\n### **Step 1: Context Building**&#x20;\n\nI start by having a conversation with the AI about event-driven architecture, asking questions until I'm confident we share the same understanding.\n\n### **Step 2: Planning**&#x20;\n\nUsing the MMDD template (available at [mmdd.dev](https://mmdd.dev/00_mmdd.md)), I work with the AI to break the project into small \"units\"—discrete, implementable chunks that can be completed and tested independently.\n\n### **Step 3: Implementation**&#x20;\n\nFor each unit, I create a detailed specification file, iterate on it until perfect, then simply tell the AI: \"implement what this file says.\"\n\n### **Step 4: Version Control Integration**&#x20;\n\nEach unit corresponds to a single commit. My git history becomes a clear narrative of the project's evolution, with each commit tied to a specific unit description.\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/32oiJj8jTk3gIEL8XlqOaW7xtVy/Fram.webp?imgSize=1000x525\" caption=\"Each unit corresponds to a single commit. My git history becomes a clear narrative of the project's evolution, with each commit tied to a specific unit description.\" />\n\n## Escaping the Spiral of Errors\n\nWhen things go wrong (and they will), MMDD provides a clear recovery path. If I notice we're spiraling into increasingly complex problems, I:\n\n1. Ask the AI to assess what went wrong and document the lessons learned\n2. Revert to the last stable commit\n3. Create a new unit that incorporates both the original goal and the lessons learned\n4. Implement a better solution with more context\n\nThis approach transformed my error rate from frequent spirals to manageable hiccups.\n\n## The Transformation: Speed, Scope, and Skills\n\nThe results of using MMDD with AI have been remarkable:\n\n* **Speed Gains:** Projects that would take a week now take a day. The overall development time decreases dramatically, even accounting for increased planning and testing time.\n* **Skill Expansion:** I've become more of a generalist, able to work across different technology stacks without deep specialization in each. Like the transition from assembly to high-level languages, I'm operating at a higher abstraction level.\n* **Experimentation Freedom:** The reduced cost of coding enables trying multiple approaches to the same problem. I can implement different solutions and choose the best one, rather than being locked into the first approach that works.\n\n## The Trade-offs: What You Gain and Lose\n\n**Time Redistribution:**\n\n* More time planning and designing (↑)\n* More time testing and debugging (↑)\n* Less time implementing (↓)\n* Overall project time (↓↓)\n\n**Skill Evolution:**\n\n* Increased: Architecture thinking, prompt engineering, testing methodology\n* Decreased: Deep technical implementation knowledge in specific frameworks\n\n**New Responsibilities:**\n\n* Code review becomes critical—you're now the quality gatekeeper\n* Context management requires discipline\n* Tool orchestration becomes a new skill\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/32oj8NVulC6DlXD514cM5e7TzMn/Fram.webp?imgSize=1000x525\" caption=\"Adopting Q CLI and MMDD not only changes the time to deliver, but also the skills and use of the time.\" />\n\n## The Verification Imperative\n\nWorking with AI-generated code makes testing non-negotiable. You become the code reviewer for a very productive but occasionally unpredictable developer. This means:\n\n* Comprehensive testing strategies are essential\n* Code review skills become more important than ever\n* Understanding what the code does (even if you didn't write every line) is crucial\n\n## Practical Takeaways for Your Next Project\n\nIf you're ready to experiment with AI-driven development:\n\n1. **Start Small:** Choose a well-defined, low-risk project for your first experiment\n2. **Document Everything:** Create files for context, decisions, and plans—don't rely on chat history\n3. **Break It Down:** Divide your project into the smallest possible implementable units\n4. **Test Relentlessly:** Assume every AI-generated piece of code needs verification\n5. **Embrace the Iteration:** Plan to refine and improve rather than getting it perfect on the first try\n\n## Looking Ahead: The Future of Development\n\nCodeRipple represents more than just a successful hackathon project—it's a glimpse into how software development is evolving. We're not replacing developers; we're augmenting human creativity and problem-solving with AI execution capabilities.\n\nThe developers who thrive in this new paradigm will be those who learn to effectively collaborate with AI, understanding both its capabilities and limitations. They'll be architects, reviewers, and orchestrators rather than primarily implementers.\n\n## Resources and Next Steps\n\nThe complete codebase for [CodeRipple is available in GitHub](https://github.com/robertoallende/coderipple). You can also explore the MMDD framework at [https://mmdd.dev](https://mmdd.dev).\n\nIf you're attending AWS events or working on similar AI-assisted development projects, I'd love to connect and hear about your experiences. The AI development community is still young, and sharing our learnings helps everyone move faster.","status":"LIVE","title":"Build and ship an entire app using Amazon Q"},{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2yxKHol9N5tba3Uju1eRcHUymSm","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"A few days ago, I came across the AWS Builder Challenge—and I couldn’t resist. \n\nI love these sprints: the adrenaline of a deadline, the chance to challenge assumptions, and the opportunity to try and learn something new.","heroImageUrl":"https://prod-assets.cosmic.aws.dev/a/31mE4kLoMdzVwcaGs7EWKMcUhxJ/jour.webp","tags":["cloud-launch-challenge-1","amazon-q-developer","aws-amplify"],"versionId":"2yxKHoRL1L6GjJbhw1xBQ8TblwQ"}},"createdAt":1750770698988,"isLiked":false,"lastModifiedAt":1756132002110,"lastPublishedAt":1756132002000,"likesCount":15,"markdownDescription":"For this challenge, I set myself two rules:\n\n1. **Build 100% of the code with AI**, using **Amazon Q CLI** and my **Micromanaged Driven Development (MMDD)** workflow.\n2. **Do something different**, because another static portfolio page just wouldn’t cut it.\n\nAfter reading a tweet about companies that went **mobile-first**, I started wondering: what would it look like to build an **AI-first** website? It’s not an original idea, but it’s definitely a challenging one—especially when you’re trying to integrate static content with conversational experiences.\n\nThat thought became the spark for my new website: [https://allende.nz](https://allende.nz/).\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/31m8kBSjnoIOT1Tk5aufQXVuM8c/alle.webp?imgSize=1000x525\" alt=\"My AWS Builder Challenge Deliverable: 100% AI-Built, Chatbot-Driven\" caption=\"My AWS Builder Challenge Deliverable: 100% AI-Built, Chatbot-Driven\" />\n\n## **Good artists copy; great artists steal.**\n\nA week isn’t much time — even when you have **Amazon Q** writing the code for you. Building a polished **GenAI chat interface** is no small feat.\n\nThat’s where **assistant-ui** came to the rescue. According to its tagline, *“assistant-ui helps you create beautiful, enterprise-grade AI chat interfaces in minutes. Whether you're building a ChatGPT clone, a customer support chatbot, an AI assistant, or a complex multi-agent application, assistant-ui provides the frontend primitive components and state management layers to focus on what makes your application unique.”*\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/31m9QNxC4JRyACTMgzqqQbu6UJq/assi.webp?imgSize=1000x525\" alt=\"assistant-ui helps you create beautiful, enterprise-grade AI chat interfaces in minutes.\" caption=\"assistant-ui helps you create beautiful, enterprise-grade AI chat interfaces in minutes.\" />\n\nWith assistant-ui handling the UI and state complexity, I could focus on **integrating the conversational flow** and shaping the experience, instead of spending days coding interface details from scratch.\n\nThe plan was to build the interface with **React and Tailwind**, so I was very happy to see that **assistant-ui** was fully compatible with both. That meant I could keep my preferred stack, focus on the conversational experience, and still end up with a **clean, responsive UI** that felt like it belonged in a modern GenAI product.\n\n## **Building Every Line with AI: The MMDD Way**\n\nMMDD stands for [**Micromanaged Driven Development**](https://mmdd.dev)—a methodology of prompts I created to help manage context when working with GenAI tools like **Amazon Q CLI**.\n\nI first developed MMDD during the **AWS Lambda Hackathon**, where I team with Amazon Q CLI to build [**CodeRipple**](https://github.com/robertoallende/coderipple), an event-driven serverless app powered by Strand Agents that generates and updates documentation automatically. That entire project—just like this one—was written **100% by AI**.\n\nMMDD is built on three principles:\n\n* **Every decision goes through me** - AI suggests, I ask, I iterate with AI and then I decide\n* **Document everything -** documents are the glue that holds the world together\n* **One small change at a time** - Big changes lead to big disasters\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/31mBK6b2Kvwvmmv5AVJiVJad933/amaz.webp?imgSize=1000x525\" alt=\"Every MMDD project starts with a single prompt\" caption=\"Every MMDD project starts with a single prompt\" />\n\nEvery MMDD project starts with a single prompt:\n\n> “Using `00_mmdd.md`, generate `01_main.md` for the project that does …”\n\nIt’s a structured, iterative way to guide the AI—keeping the process predictable while letting the AI handle all of the heavy lifting.&#x20;\n\nOnce you've the plan, you iterate between units. Each unit defines and implements a small change to the code base.&#x20;\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/31mI19XsOgjrfXL7cDe1gI5etsA/unit.webp?imgSize=1000x525\" alt=\"MMDD Units define small changes in the code base.\" caption=\"MMDD Units define small changes in the code base.\" />\n\n## **The Compound Misdirection Challenge**\n\nWith high speed comes the demand for precision. Using GenAI to write software lets you produce code incredibly fast—but if you’re not careful, you can end up in a very curious destination before you even notice.\n\n**assistant-ui** is an opinionated UI library. **React** and **Tailwind**… well, they’re opinionated too. So, you’d expect the integration to be smooth. But at the start of the project, it wasn’t.\n\nFollowing **MMDD**, [I organized tasks into **Units**](https://github.com/robertoallende/allende/tree/main/dev_log). Every time I started a new task, I iterated with **Amazon Q** to define the unit: we discussed requirements, explored decisions, and only after everything was clear, started implementing. The problem is, if that conversation is incomplete or wrong, the machine will decide for you—and as a micromanager, that’s the last thing I want.\n\nThat’s exactly what happened during the UI integration. I needed a very specific behavior, but Q started to fight against assistant-ui. A fix would break something that had worked before, and if you don’t step in, you end up in an endless spiral of compounded errors and issues.\n\nFortunately, there are solutions for this:\n\n* **Version control is king.** When I realized Q was fighting a war between assistant-ui and React/Tailwind, I rolled back to earlier units to reset the context.\n* **Context sharing with Q.** I explained the issue to Q so we could prevent the same mistakes in the next iteration.\n* **Leverage the source.** I cloned the entire assistant-ui repository and asked Q to generate a summarized “how-to” guide, which I kept in the context for the rest of the project.\n\nI had a similar situation when I deployed to **AWS Amplify** and ran into monorepo setup issues. In that case, I turned to StackOverflow, found the right solution, and fed it back to Q. Only difference? I did that after trying fifteen other alternatives first. Sometimes, you can’t hand a human job to a bot.\n\n&#x20;\n\n## **When There Are No Issues, It’s Like Driving a Ferrari**\n\nA couple of months ago, [**Martin Fowler** compared GenAI with High Level languages](https://martinfowler.com/articles/2025-nature-abstraction.html): *if high-level languages abstracted us from machine code, LLMs introduce a new, non-deterministic layer of abstraction—changing not just how we write software, but what it means to “program.”*\n\nGenAI introduces a new level of abstraction that enables you to write high-quality code incredibly fast. When you stay disciplined—taking small steps and following MMDD or Spec-Driven Development—the workflow becomes not just fast, but effortless. It’s like driving a Ferrari on an open road.\n\nOne example? The **contact form**.\n\nBecause this is a conversational website, there’s no static “Contact Us” page. Instead, if you open the conversation section and type:\n\n> “Send an email to Roberto”\n\n…the *old school bot* will guide you through the questions, collect your information, and trigger the email flow.\n\nBehind the scenes, that conversation ties into a **Lambda function**, which eventually requires an **EventBridge configuration** and some supporting resources—everything Ana Cunha described in her excellent blog post titled [Contact Form 📧 - Making Your Website Interactive](https://builder.aws.com/content/31c6EGIZUe9a5eLwMKBv2TuDn2l/contact-form-making-your-website-interactive).\n\nBut here’s where the GenAI workflow shines:\n\n* You **read the blog post** to understand the architecture and confirm it matches your needs.\n* Then, you hand that context to **Amazon Q** and simply ask it to follow the tutorial to **generate AWS CLI scripts** for deploying your Lambda and related resources as Infrastructure as Code.\n\nOf course, you’re not limited to AWS CLI scripts. If your stack uses **CloudFormation** or **Terraform**, the same approach works beautifully—AI generates the baseline scripts, and you just refine and deploy.\n\n<Image url=\"https://prod-assets.cosmic.aws.dev/a/31mC6L7rc2o6eIxP4m5f2Am94IQ/cont.webp?imgSize=1000x525\" alt=\"You hand that context to Amazon Q and simply ask it to follow the tutorial to generate AWS CLI scripts\" caption=\"You hand that context to Amazon Q and simply ask it to follow the tutorial to generate AWS CLI scripts\" />\n\n## **My Wow Moment: AWS Amplify**\n\nI was genuinely **amazed** at how fast and easy **AWS Amplify** was to use. It was my first time trying it, so I asked **Amazon Q** to create a quick comparison matrix against tools I already knew—like **GitHub Actions**—to get a sense of what to expect.\n\nWhen I saw the matrix, my first thought was: *“This is promising.”*\n\n| Task                  | AWS Amplify                                                                | GitHub Actions                                                                |\n| --------------------- | -------------------------------------------------------------------------- | ----------------------------------------------------------------------------- |\n| Initial Setup         | One-click connect to your repo, auto-detects framework and build settings. | Requires writing workflow YAML, setting permissions, and configuring runners. |\n| Build & Deploy        | Automatic build and deploy pipeline out of the box.                        | Separate build and deploy jobs, often with custom scripts.                    |\n| Environment Variables | Managed in the console; auto-injected at build time.                       | Requires secrets setup and manual mapping in YAML.                            |\n| Branch Previews       | Automatically builds preview environments for pull requests.               | Needs custom jobs and cleanup logic to manage preview environments.           |\n| Custom Domains & SSL  | Integrated setup, free SSL certificate via ACM.                            | Manual DNS and certificate management, plus custom scripts.                   |\n\nAnd then I actually did the deployment... and wow. The word here is **smoooooth**—something you don’t often see in deployment flows.\n\n* **The project setup:** Smooth.\n* **The build:** Smooth.\n* **The branch connection:** Smooth.\n* **The domain registration:** Smooth.\n\nI’m officially in love with Amplify. It’s earned a permanent spot in my workflows for future projects.\n\n## **Lessons Learned**\n\nEvery project teaches you something new—this one taught me a lot. Here are the biggest takeaways from building a **100% AI-generated, chatbot-driven website** in just a week:\n\n* **Structure beats speed**\n  GenAI can write code faster than you can type, but speed without structure is chaos. **MMDD** kept me disciplined: defining, refining, and then implementing every unit step-by-step. That structure kept me from spiraling into unmanageable complexity.\n* **Version control is your lifeline**\n  When things went sideways (and they did), **git saved the day**. Frequent commits and clear messages made it painless to roll back, reset, and guide Q back on track. In an AI-first workflow, version control isn’t optional—it’s essential.\n* **Human oversight matters**\n  AI can generate incredible solutions, but **it doesn’t understand context like you do**. Reviewing, refining, and sometimes overriding Q’s output was the difference between a buggy mess and a working product. Think of AI as a very fast, very eager junior developer—it still needs guidance.\n* **AWS services are simpler than you think**\n  I’d never used **Amplify** before, and **Lambda** was something I’d only toyed with. This project changed that. Amplify made hosting, CI/CD, and domain management so easy that I can’t imagine future workflows without it. And Lambda? Perfect for lightweight, serverless logic without the hassle of managing servers.\n\nA special shout-out to Ben Fowler and Ana Cunha for their excellent [step-by-step guide](https://builder.aws.com/content/31C2WxIDSQive7q2Dv5xNFCmYJj/aws-builder-challenge-2-build-a-website-on-the-cloud) that walks you through setting up a website from scratch. Reading that guide first gave me the confidence to let Amazon Q generate the automation scripts instead of manually clicking through the console.\n\n## **Demo: Talk to the Bot**\n\nYou can try the **demo bot** right here:  [**https://allende.nz**](https://allende.nz)\n\nIt’s an “old school bot” for now, but it already mimics the conversational experience. Instead of filling out a boring contact form, you can simply start typing and the bot will guide you through the flow.\n\n### **Fun things to try**\n\n* **Type:** “Send an email to Roberto”\n  The bot will guide you through the questions and “send” the message.\n* **Ask questions about AI-first websites**\n  It will share a brief explanation of what the concept means and why this project follows that approach.\n* **Chat about football — especially Messi**\n  The bot loves to talk about Messi and has a few fun scripted responses to keep the conversation lively.\n*\n\n## **Try It and Share Your Feedback**\n\nTake a look at the site, explore the content, and have a chat with the **old-school demo bot.**\n\nI’d love to hear your thoughts:\n\n* What parts of the experience did you enjoy?\n* What felt smooth or surprisingly natural?\n* What would you change or improve?\n\nThis project is just the **first step toward a truly AI-first website**. Your feedback will help shape the next version — one powered by **Amazon Nova Micro** for real, low-latency conversations.\n\nCurious about the code? The **source is available here**:  [https://github.com/robertoallende/allende](https://github.com/robertoallende/allende)","status":"LIVE","title":"Not a portfolio. Not a blog. A conversation"},{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2y6nQgj1FVuaJIn9rFLThIslwaJ","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"Yes, it says micromanagement - and this time it makes sense.","heroImageUrl":"https://assets.community.aws/a/2yxHzwMqvqa605bKfArJPkWGZLX/micr.webp?imgSize=1000x525","tags":["amazon-q-developer","amazon-q-cli","genai","micromanageddrivendevelopment"],"versionId":"2yxY2mrpBMYTErPCBPOwx43laUg"}},"createdAt":1750777486884,"isLiked":false,"lastModifiedAt":1750777522044,"lastPublishedAt":1750774663797,"likesCount":15,"markdownDescription":"The first time I integrated AI into my IDE, I was cocky. I typed \"make a Gmail clone that uses a JSON file for content\" and watched in amazement as it actually worked. The demo was flawless - I felt like a wizard.\n\nA few days later, reality hit. I needed to make it responsive for mobile demos. Simple request, right? Wrong. The AI suggestions broke everything. The layout collapsed, features disappeared, and each \"fix\" created three new problems. Worse? No version control. I couldn't even go back to my working demo.\n\nGame over. I felt scammed.\n\nThe problem is simple: AI gives you working code fast, but it doesn't give you understanding or control. You're flying blind on every modification, hoping the next suggestion won't break everything. When it inevitably does, you're stuck with code you can't fix because you never really understood it in the first place.\n\nAnd don't even start talking about hallucinations.\n\nWhat if I told you that the secret for success has been always in front of us, even worse, we spent years giving it bad reputation. It's already on the title, but let me say it again: **MICROMANAGEMENT**.\n\n## What is Micromanagement you ask?&#x20;\n\nGlad you did...\n\nMicromanagement, stripped of its workplace baggage, is simply a systematic approach to maintaining control through granular oversight. In procedural terms:\n\n* **Break down complex tasks** into smaller, reviewable components\n* **Validate each step** before proceeding to the next\n* **Document decisions and rationale** for future reference\n* **Maintain feedback loops** to course-correct quickly\n* **Never delegate without verification** of outcomes\n\nIt's not only being controlling - it's about being systematic controlling.\n\n## Introducing Micromanaged Driven Development (MDD)\n\nDear humans, here's the developing guidelines that turns AI from your unpredictable enthusiastic intern into your **obsessively supervised** assistant.\n\nMDD is built on three principles:\n\n* **Every decision goes through me** - AI suggests, I ask, I iterate with AI and then I decide\n* **Document everything -** documents are the glue that holds the world together\n* **One small change at a time** - Big changes lead to big disasters\n\n## See MDD in Action\n\nWant to see how this obsessive supervision actually works? Check out this demo where I build a feature using MDD with Amazon Q Developer. Notice how every AI suggestion gets questioned, refined, and documented before implementation.\n\n<Youtube id=\"nVMO0FzL_Lk\" />\n\n## What You Get with MDD\n\nWhen you embrace your inner micromanager, here's what happens:\n\n* **Fewer \"what happened here?\" moments** - You know exactly what changed and why\n* **Faster debugging** - Your documentation trail leads you straight to the problem\n* **Code you actually understand** - Because you questioned every piece of it\n* **Confidence in modifications** - Small, documented changes are easy to roll back\n* **Better AI suggestions over time** - The AI learns your patterns through iteration\n\n## Getting Started: Your First MDD Session\n\nReady to micromanage your way to better code? Here's how to start:\n\n1. **Set up your documentation system** - Check the [MDD GitHub repo](https://github.com/robertoallende/micromanaged-driven-development) for templates showing exactly how to document your AI interactions and decisions.\n2. **Practice the questioning habit** - For every AI suggestion, ask \"Why this approach?\" \"What are the alternatives?\" \"What could go wrong?\"\n3. **Start small** - Pick a minor feature or bug fix for your first MDD experiment.\n\nBut there's one more thing... MDD itself has been written following MDD principles. Want proof? Check [the commit history](https://github.com/robertoallende/micromanaged-driven-development/commits/main/) in the GitHub repo. Every decision, every iteration, every AI interaction is documented. It's MDD all the way down.\n\n## Try Now!\n\nThink I'm crazy? Prove me wrong. Try MDD on your next AI coding session. I guarantee you'll either love the control or hate the extra work - but either way, you'll know exactly what your code is doing. Share your results - success stories, failures, improvements.&#x20;\n\nJoin the growing community of micromanagers that succeed coding with AI.\n&nbsp;","status":"LIVE","title":"Code with AI: Micromanagement is all you need"},{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2y6VTiNmyMKGnFslikzXkfecPd9","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"June 4-5, 2025 saw AWS bring together thousands of developers, builders, and business leaders at Sydney's International Convention Centre for their annual Summit. Across 90+ sessions and 80+ partner showcases, the event highlighted both where AWS is directing their efforts and how customers are putting those tools to work Amazon— here are five things that stood out to me from the two days.","heroImageUrl":"https://assets.community.aws/a/2y6XrHseie0wDzZnqjmJ0ZWgYlW/Fram.webp?imgSize=1000x525","tags":["agentic-ai","leadership","data-lakes","cost-optimization","modernization"],"versionId":"2y7PHURAlXDwrXQfzPPDqykO6zS"}},"createdAt":1749182550118,"isLiked":false,"lastModifiedAt":1749182652710,"lastPublishedAt":1749182530853,"likesCount":6,"markdownDescription":"## The Challenge of Choice\n\nWith 220 scheduled sessions spread across the two-day event, I created a word cloud from the session titles to visualize the key themes (pictured below). What immediately became clear was the breadth of topics covered—from generative AI and data analytics to security, migration, and developer tools. The resulting visualization perfectly captures the current state of cloud computing: AI and DATA dominating the conversation, but with traditional concerns like security, data management, and business transformation remaining equally critical.\n\n![](https://assets.community.aws/a/2y6ZUsHT4ccKtQ3ML5JRPp41MaM/Fram.webp?imgSize=1000x525)\n\nThe permanent challenge throughout the summit was deciding which session to attend, with at least five or more tracks running simultaneously at any given time. This abundance of choice, while sometimes overwhelming, reflected the maturity and diversity of the AWS ecosystem. Whether you were a startup founder looking to scale, an enterprise architect planning a migration, or a developer exploring the latest AI tools, there was genuinely something for everyone.\n\nBefore diving into my five key takeaways, it's worth acknowledging the topics that deserve dedicated posts of their own. **Security** was a major focus throughout the summit, with AWS showcasing how they're serving all major Australian banks including ANZ and Westpac. The trust these institutions place in AWS infrastructure speaks volumes about the platform's enterprise-grade security capabilities, and the dedicated security track offered deep dives into everything from compliance frameworks to threat detection.\n\nSimilarly, **cloud computing and scaling** emerged as a persistent theme. One standout was hearing **Brendan Humphreys** share insights into how Canva is scaling their platform to serve millions of users globally. These real-world scaling stories from Australian companies provided practical insights that went far beyond theoretical discussions.\n\n## The Human Element in Technology Transformation\n\n> **What would happen if you could think beyond your own constraints?**\n> Phil Le-Brun\n\nAcross the two keynote sessions—Builders Day featuring Rianne van Veldhuizen and Francesca Vasquez, and Innovation Day with Rada Stanic and Phil Le-Brun—a consistent theme emerged that went beyond the impressive technical capabilities on display. While the AWS executives showcased everything from custom silicon to multi-region databases, it was Phil Le-Brun's message about **organizational change** that provided perhaps the most practical takeaway for attendees. His central argument was both simple and profound: \"*while we can solve every problem we can imagine with technology today unless we change how we work and the skill sets we have nothing changes.*\" This insight reframed the entire summit discussion, suggesting that the real barrier to innovation isn't technological limitation but our own organizational constraints and imagination.\n\n![The only thing that's limiting us is our imagination - Le-Brun challenges us to take ownership.](https://assets.community.aws/a/2y71XzTCtykjpo8RQhnh9VtFOW7/Fram.webp?imgSize=1000x525 \"The only thing that's limiting us is our imagination - Le-Brun challenges us to take ownership.\")\n\nLe-Brun's approach to organizational transformation centers on what he calls Amazon's \"Day One\" culture—a philosophy built on three foundational pillars that any organization can adopt.&#x20;\n\nFirst is **clarity**: ensuring everyone understands the organization's purpose and priorities. He suggested a simple but revealing test: \"pick 10 people at random, ask them what is the purpose of your organization and what are the top three priorities—data tells us most answers will be different.\" The second pillar is **ownership**, moving beyond job descriptions to give people accountability for meaningful business outcomes. Using the \"pig and chicken\" metaphor, he emphasized finding the person who wakes up every morning asking \"are we making progress towards a meaningful outcome?\" The third pillar, **curiosity**, addresses what he sees as a critical gap in organizational learning. \"*Did you know that if you're a five-year-old kid you probably ask up to 100 questions a minute... by the time you're 15 it's down to about three*,\" he noted, arguing that organizations systematically train people to stop asking questions—which is \"deadly to innovation.\"\n\nLe-Brun's message wasn't just theoretical—he provided concrete examples that resonated throughout the developer-heavy audience. He cited a striking statistic that \"*the average developer in large enterprises spends five hours a week developing*,\" meaning most are done with actual coding by Monday lunchtime, with the rest of their time consumed by meetings, waiting for decisions, and navigating gatekeepers. This waste of human potential, he argued, can't be solved by tools like Amazon Q Developer alone if the underlying organizational dysfunction remains unchanged. His solution involves creating smaller, empowered teams—Amazon's famous \"two pizza teams\"—that combine cross-functional skills with clear business outcomes and the autonomy to deliver them. He challenged leaders to \"be like a teenager, be curious about the technology\" while also being \"humble\" enough to admit uncertainty, \"think big\" rather than settling for incremental 10% improvements, and most importantly, \"set your builders free\" by removing the bureaucratic layers that constrain front-line talent.\n\nWhat made Le-Brun's presentation particularly powerful was how it recontextualized every other session at the summit. Whether attendees were learning about the latest AI models in Amazon Bedrock, exploring serverless architectures, or diving into security best practices, his message served as a reminder that successful technology adoption requires parallel investment in organizational change. His historical perspective—drawing parallels between today's AI revolution and the Industrial Revolution—helped frame current disruptions not as unprecedented challenges but as part of a recognizable pattern where \"*new skills and technology opens up a whole new world of opportunity*.\" This human-centered approach to transformation provided a grounding counterpoint to the technical excitement throughout the summit, suggesting that while AWS continues to democratize access to powerful technologies, the organizations that will truly benefit are those willing to evolve how they work, learn, and make decisions. In essence, the most sophisticated cloud infrastructure in the world is only as transformative as the people and processes that leverage it. \n\n## Tech Debt Is the Silent Killer of Innovation\n\nOne of the most compelling themes across multiple sessions was how technical debt has become the invisible barrier preventing organizations from leveraging modern capabilities like AI and cloud-native architectures. The reality presented across three powerful case studies is both sobering and hopeful: while legacy systems are quietly strangling organizational agility, AI-powered tools are now making modernization faster than ever before.\n\n#### The Hidden Cost of Standing Still\n\nThe numbers tell a stark story. As Bilal Alam, AWS Specialist Solutions Architect for AI/ML, revealed, talented engineers in large organizations spend only **13% of their time actually writing code**. The remaining 87% disappears into \"undifferentiated heavy lifting\"—patching security vulnerabilities, upgrading frameworks, and maintaining systems that should have been modernized years ago.\n\nThis isn't just a productivity problem; it's an innovation killer. One local enterprise customer discovered that modernizing their hundreds of legacy applications would cost between $200,000 for simple apps to over $1 million for complex systems—money spent just to maintain current functionality, not add new capabilities.\n\n#### When Legacy Becomes a Business Liability\n\nDymocks' transformation journey provided a perfect case study. Their Product Information Management system—managing 40 million SKUs—consumed over **$250,000 annually** just to operate three servers, required a full day to reboot, and demanded a dedicated three-person team for 24/7 maintenance. As Saif Abdallah, Head of Architecture and Transformation, described it: \"a beautiful legacy train that belongs in a museum.\"\n\n#### The AI-Powered Solution\n\nWhat's changed dramatically is how generative AI is accelerating modernization timelines. **Amazon Q Developer** now allows teams to submit entire application repositories and receive modernized code in hours. Alam's customer used a five-person team to upgrade 1,000 Java applications from version 8 to 17 in just **two days**—each application taking an average of 10 minutes.\n\nDymocks achieved even more dramatic results, reducing infrastructure costs by **90%** while improving capabilities. Product updates that previously happened once daily now occur every 30 minutes across their entire catalog.\n\n#### The Strategic Framework\n\nAWS's approach, refined across hundreds of migrations, breaks modernization into three phases: **assess, mobilize, and migrate/modernize**. The key insight from all presentations: don't try to \"boil the ocean.\" Start with high-impact, lower-risk applications to build confidence and capabilities.\n\n![Evgeny Vaganov presents AWS's three-step cloud migration approach](https://assets.community.aws/a/2y73KUFjocP2kb7LvPBTWOMrOv3/Fram.webp?imgSize=1000x525 \"Evgeny Vaganov presents AWS's three-step cloud migration approach\")\n\nAs Evgeny Vaganov noted from his experience across hundreds of customer journeys, successful modernization requires more than powerful tools—it demands organizational alignment and a shift toward continuous modernization rather than periodic \"big bang\" projects.\n\nThe summit's message was clear: with AI-powered tools reducing modernization friction, the competitive advantage belongs to organizations that can continuously evolve their technology stack rather than letting technical debt accumulate until a crisis forces action.\n\n## Real-Time Data Lakes: From Operational Silos to Unified Analytics\n\nOne of the most technically compelling sessions at the summit tackled a challenge that resonates across virtually every enterprise: how to bridge the gap between operational databases and analytical systems without sacrificing real-time capabilities or transactional integrity. Masudur Rahaman Sayem's deep dive into \"architecting real-time transactional data lakes\" revealed both the complexity of modern data architectures and the sophisticated solutions now available to tame them.\n\n#### **The Reality of Fragmented Data**\n\nThe traditional model of applications pointing directly to databases no longer reflects how modern organizations generate and consume data. As Sayem outlined, today's enterprises face a \"diverse ecosystem of devices, applications, and microservices generating data that are no longer relying on database as the first entry point.\" Whether it's a FinTech company needing to sync PostgreSQL transactional data for machine learning models, or a gaming platform requiring partition evolution capabilities for massive datasets, the demand for unified analytics has never been higher.\n\nThe challenge extends beyond simple data movement. Organizations need consistent views across operational and analytical systems, scalable platforms that can grow with their data volumes, and unified access that doesn't lock them into engineer-specific formats. Most critically, they need this unification to happen in real-time, not through batch processes that create hours or days of lag.\n\n![Masudur Rahaman Sayem: \"The data lake is fundamentally different than database.\"](https://assets.community.aws/a/2y78c4pYDsGIKChtn49TRqaLPln/Fram.webp?imgSize=1000x525 \"Masudur Rahaman Sayem: \\\"The data lake is fundamentally different than database.\\\"\")\n\n#### **The Hidden Complexity of Data Lake Management**\n\nWhat makes this particularly challenging is that data lakes are \"fundamentally different than databases.\" While databases excel at continuous insert, update, and delete operations, data lakes traditionally struggle with these same operations, leading to data consistency issues and performance degradation over time. Organizations find themselves caught between the operational agility they need and the analytical capabilities they want, often requiring separate systems that create data silos and integration headaches.\n\nThe infrastructure burden compounds these challenges. Self-managed connectors for Change Data Capture (CDC) require dedicated teams for provisioning, capacity planning, and ongoing maintenance. As Sayem noted from his experience with hundreds of customers, teams often provision for peak loads, cannot scale down to zero during quiet periods, and struggle with the IO-bounded nature of streaming workloads that don't respond well to traditional CPU-based scaling policies.\n\n#### **The Apache Iceberg and Amazon Data Firehose Solution**\n\nThe answer lies in combining Apache Iceberg's database-level capabilities with Amazon Data Firehose's fully managed data delivery. Iceberg brings transactional integrity to data lakes, supporting massive datasets with billions of rows while providing schema evolution, time travel capabilities, and ACID transactions. Its two-layer architecture—metadata for transactional features and data layer for storage—delivers the reliability of databases with the scale of data lakes.\n\nAmazon Data Firehose eliminates the infrastructure management burden entirely. Rather than deploying and maintaining CDC connectors, organizations can create streams that automatically provision, scale, and manage the data pipeline. The service supports real-time delivery with buffer configurations from 0 seconds to 900 seconds, allowing teams to balance latency against write optimization based on their specific needs.\n\n#### **Practical Implementation and Governance**\n\nWhat stood out in Sayem's presentation was the attention to real-world implementation challenges. Data Firehose's routing capabilities allow sophisticated data distribution—from simple JSON query expressions for single-table destinations to complex AWS Lambda functions for multi-table routing with transformation logic. The service handles insert, update, and delete operations while supporting exactly-once delivery and automatic schema evolution.\n\nFor organizations dealing with compliance requirements, the platform provides encryption with both AWS-managed and customer-managed keys, secret management integration for database credentials, and comprehensive monitoring through CloudWatch. Cross-account connectivity through MSK's multi-VPC capabilities ensures that security boundaries remain intact while enabling data flow.\n\nThe summit's message was clear: the days of choosing between operational agility and analytical depth are ending. With managed services handling the complexity of real-time data lake architectures, organizations can focus on extracting value from unified data rather than managing the infrastructure that delivers it. As data volumes continue to grow and real-time requirements become standard, the competitive advantage belongs to those who can seamlessly blend operational and analytical workloads without sacrificing either performance or governance.\n\n## Agents: From Distributed Systems to Autonomous Intelligence\n\nPerhaps no topic captured more attention across technical, strategic, and business audiences at the summit than the evolution of AI agents. What emerged from multiple sessions was a fascinating convergence: the distributed systems patterns that architects have used for decades are now the foundational blueprints for building intelligent, autonomous systems that can reason, plan, and act without human intervention.\n\n![Ben Hillman quoting Jeff Bezos on the promise of AI agents to simplify and enhance our lives.](https://assets.community.aws/a/2y7HzfoI5FyT81QdZUGgBWQijRP/Fram.webp?imgSize=1000x525 \"Ben Hillman quoting Jeff Bezos on the promise of AI agents to simplify and enhance our lives.\")\n\n#### The Architecture Behind the Intelligence\n\nAndrew Hooker's analysis of agent workflow patterns demonstrated how traditional distributed systems architectures map directly to modern agentic systems. Prompt chaining mirrors event choreography, routing patterns become intelligent classifiers, and parallelization enables scatter-gather approaches where multiple agents can independently reason over portions of complex problems. The difference is that instead of static rules determining workflow paths, LLMs dynamically interpret intent and adapt routing based on context.\n\nThis architectural foundation explains why organizations are suddenly able to tackle problems that seemed intractable just months ago. BGL's journey from single-agent implementations to sophisticated multi-agent systems illustrates the practical impact: what started as a 30-page prompt managing 100 different functions evolved into specialized agents that can complete complex compliance workflows that previously required two to three hours of concentrated human effort—now targeting 30-minute completion times with autonomous execution.\n\n![Andrew Hooker presenting a comprehensive overview of AI agent architecture patterns](https://assets.community.aws/a/2y7JHGtp2HKdZj82Vz6kw0UZ7Up/Fram.webp?imgSize=1000x525 \"Andrew Hooker presenting a comprehensive overview of AI agent architecture patterns\")\n\n#### From Proof of Concept to Production Reality\n\nThe most compelling insights came from James Luo's candid account of BGL's progression to production multi-agent systems serving 300,000 funds representing $500 billion in assets. As James Luo explained, \"the prompt grows up to 30 pages just to explain what to call and when, as the prompt grow up, so do the cost and the latency.\" The solution wasn't more powerful models—it was better architecture through specialized agents with narrowly defined responsibilities.\n\nThe customer impact speaks for itself. Where users previously navigated between 60+ screens and hundreds of buttons, they can now upload a hand-drawn sketch and watch the system instantly understand their intent and execute appropriate actions. What makes BGL's approach particularly noteworthy is their measurement framework: success is quantified by \"how many hours of human effort your agent can take off your client's plate.\"\n\n#### The Integration Challenge and Strategic Future\n\nMithil Shah's exploration of Model Context Protocol (MCP) addressed one of the most pressing challenges: connecting intelligent systems to enterprise tools without creating integration nightmares. MCP transforms the traditional M×N integration problem into an M+N pattern by standardizing how AI applications communicate with external resources—essentially \"USB for AI applications.\"\n\n#### The Business Case for Autonomous Operations\n\nThe workshop sessions revealed how forward-thinking organizations are approaching agentic AI as a strategic capability that can reshape entire business processes. Melanie Li and James Luo highlighted the progression from conversational chatbots to specialized agents that perform specific tasks—like the legal team that reduced 80% of their time spent on routine employee queries by deploying a legal agent connected to internal knowledge bases.\n\nThe business transformation extends beyond efficiency gains. Organizations are discovering they can eliminate entire categories of manual work: BGL's clients can now submit complex compliance requests through sketches rather than navigating dozens of screens, while the underlying agents handle multi-step workflows autonomously. This shift represents a fundamental change from designing user interfaces to designing experiences where agents become the primary interface.\n\nFor business leaders, the key insight was that agentic AI succeeds when organizations are willing to \"give up control\"—not to the technology itself, but to new ways of designing processes where agents handle workflow orchestration while humans focus on outcomes and exceptions. The technology has reached a remarkable threshold: Claude 3.5 Sonnet can now complete half of the tasks that take humans 50 minutes to do, with this capability doubling every seven months. Organizations that master these architectural patterns will be positioned to capture value as autonomous systems become the primary interface between businesses and their customers.\n\n## Cost Optimization: Beyond Tools to Cultural Transformation\n\nCost optimization emerged as a critical theme throughout the summit, with two standout sessions demonstrating how organizations can move beyond reactive \"panic optimization\" to build sustainable, data-driven financial management practices.\n\n![Anushree Umesh and Jane Yin connected Frugal Architecture laws with AWS tools in an engaging session](https://assets.community.aws/a/2y7NPLRqKwogIfaK8S70l6ztAoZ/Fram.webp?imgSize=1000x525 \"Anushree Umesh and Jane Yin connected Frugal Architecture laws with AWS tools in an engaging session\")\n\n#### **The Power of Intelligent Usage Detection**\n\nNational Australia Bank's collaboration with AWS showcased a sophisticated approach to dynamic cost optimization that goes far beyond traditional tag-based scheduling. Their journey from static, preset schedules to intelligent power management illustrates the potential of using VPC flow logs and CloudTrail data to understand actual application usage patterns.\n\nThe results speak volumes: supporting close to 500 applications across 2,000+ non-production environments, NAB has transformed cost management from an optional task into standard operating procedure. As Chaitanya Krant noted, \"This is not a one-time win in our case. It is a continuous improvement process.\" Their open-source solution, released during the summit, enables other organizations to scan their environments and identify optimization opportunities without installing agents or disrupting existing applications.\n\n#### **Beyond Tools: Building Cost-Aware Culture**\n\nPerhaps more importantly, the sessions emphasized that successful cost optimization requires organizational transformation alongside technical solutions. Sid Jolapara's framework highlighted five critical pillars: executive sponsorship, active finance engagement, dedicated resources, robust processes and tools, and most crucially, building a cost-aware and value-aware culture.\n\nThe sobering reality is that engineering teams already know where optimizations exist—the challenge lies in creating sustainable practices to implement them. Without cultural change, organizations fall into the cycle Jolapara described: \"the spend goes up, there's a moment where they freak out... they optimize... and then six months later, we're just back up to where it was.\"\n\n#### **New AWS Capabilities Making Optimization Easier**\n\nThe summit also introduced several new AWS features addressing the top FinOps priorities: idle resource recommendations in AWS Compute Optimizer, database optimization recommendations for RDS and Aurora, and the new Savings Plan Purchase Analyzer for more strategic commitment-based purchasing. These tools reflect AWS's focus on making optimization decisions more data-driven and less dependent on guesswork.\n\nThe cost optimization track included numerous lightning talks and hands-on workshops that provided practical guidance for implementing these strategies. The consistent message across all sessions: the most sophisticated cost management tools are only as effective as the organizational commitment to use them systematically and strategically.\n\n## **Closing Thoughts**\n\nAWS Summit Sydney 2025 was an incredible experience that delivered both deep technical insights and valuable leadership lessons. From hands-on workshops that challenged us to think like AI agents to inspiring keynotes that outlined the future of cloud innovation, every session offered something meaningful to take back to our organizations.&#x20;\n\n![Just me, casually stealing the stage for a photo—fake it until you make it, they say 😀](https://assets.community.aws/a/2y7Ke0bLhqN1bZkI4IL1kZ2owsF/Fram.webp?imgSize=1000x525 \"Just me, casually stealing the stage for a photo—fake it until you make it, they say 😀\")\n\nThe energy and collaboration throughout the event reminded me why these industry gatherings are so valuable – not just for the knowledge shared, but for the connections made and perspectives gained. I'm already looking forward to AWS Summit Sydney 2026, eager to see how the landscape will have evolved and what new innovations AWS will unveil. Until then, there's plenty of work to do implementing these takeaways!\n\n## **Session Recordings**\n\nAll keynotes and sessions from AWS Summit Sydney 2025 are available to watch online at [https://summitsydney.awslivestream.com](https://summitsydney.awslivestream.com). Whether you want to revisit a particular session or catch up on presentations you missed, these recordings are a valuable resource for continuing your AWS learning journey.\n\n**Copyright Notice**\n\nThe workshop materials and content referenced in this post are the intellectual property of Amazon Web Services, its subsidiaries, or their authors. This blog post is intended purely for educational and learning purposes, sharing insights from the AWS Summit Sydney 2025 experience. If you believe any content requires modification or removal, please feel free to contact me and I will address your concerns promptly.\n&nbsp;","status":"LIVE","title":"Five Takeaways from AWS Summit Sydney 2025"},{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2uTxBHfOqBru2fkVYGFg1023pXp","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"I’ve been practicing an AI First mindset for a few months now. It wasn’t something I defined from the start—it just emerged naturally from how I worked. Whether I was tackling a complex project, debugging a technical issue, or drafting a message, AI became a central part of my thinking loop.","heroImageUrl":"https://assets.community.aws/a/2xw6QV2bvJVewgjSA6T2k8g6cEv/Fram.webp?imgSize=1000x525","tags":["generative-ai","amazon-q","sharepoint","confluence","startups"],"versionId":"2uTxBG2dXa14pbb2xfg0wS2J07B"}},"createdAt":1742286227216,"isLiked":false,"lastModifiedAt":1748850134779,"lastPublishedAt":1748850134655,"likesCount":2,"markdownDescription":"## **The Genie Curse**\n\n> “AI is not accurate.”\n> “AI hallucinates.”\n\nWell—so do humans.\n\nAfter years building, mentoring, working with startups and judging in funding programs, I’ve seen it over and over again: we hallucinate too. We imagine product-market fit. We assume customer needs. We fall in love with our own ideas. Sometimes we’re right. Often, we’re not.\n\nBut here’s the twist: hallucination isn’t a flaw—**it’s a feature.** It’s fuel for creativity. Without it, there’d be *no misfits, no rebels, no troublemakers*—no one daring to build what doesn’t yet exist.\n\n<Youtube id=\"mtftHaK9tYY\" />\n\nIn myths, genies grant wishes. But the curse is built in:\nYou get what you ask for—even if it destroys you.\nThe genie doesn’t question your assumptions.\nIt doesn’t clarify your intent.\nIt just delivers. No matter the consequences.\n\nThat’s the danger—not just false information, but false direction.\n\nThis is the problem the *Lean Startup* tried to solve. Every product begins as a wish—a hypothesis. But instead of trusting the wish, it proposes a loop to test it:\n\n![Build -> Measure -> Learn](https://assets.community.aws/a/2xvzZ8mU9UxUD49G52mf7LZjix3/Buil.webp?imgSize=1000x525 \"The Lean Startup Learning Cycle\")\n\nIf it works, keep going. If not, pivot—fast.\nThe sooner you find what’s wrong, the sooner you can get it right.\n\n***\n\n## **What Does It Mean to Be AI First?**\n\nThe genie curse has a cousin: the curse of knowledge—when you’re so deep in an idea, you forget what it’s like not to know. That’s how I felt writing this. I didn’t just want to explain *AI First*—I wanted it to stick.\n\nSo I did what any AI First practitioner would do:\nI asked the machine.\n\nWhat emerged was this:\n\n> **AI First: Don’t just move fast—start smart.**\n> Most people use AI like a car—to go faster.\n> I use it like a compass.\n\nBefore I move, I ask: `Where am I?, What’s the terrain?, What’s the smartest route?`\n\nIt’s not about speed. It’s about clarity.\nNot just accelerating execution—but sharpening intent.\n\nAt first, I called AI a “**strategic amplifier**.” Technically accurate—but abstract.\nSo I tested metaphors.\n\nThe genie metaphor worked. It captured AI’s power—but also its danger. The idea was sticky, but not trustworthy. I needed something better—familiar, grounded, directional.\n\nThat’s when the compass appeared.\nNot magic. Strategy.\nNot wishes. Navigation.\n\nThat shift clarified everything: *AI First* isn’t about working faster.\nIt’s about working smarter—by thinking with the machine *before* acting.\n\nIt’s a mindset.\nA process.\n\nThe conversation didn’t begin with a prompt like:\n\n> “Write a post about AI First.”\n\nIt started with questions—shaped through conversations like:\n\n> “What are the best books on communicating complex ideas?”\n> “How do you pitch a concept so it sticks?”\n> “What makes an abstract idea like AI First feel intuitive?”\n\nEach question refined the intent. Each answer sharpened the metaphor.\n\nBecause that’s what AI First *really* means:\nStart with the question—before the task.\nStart with direction—before acceleration.\nStart with the compass.\n\n## **Execution**\n\nOnce the intent is clear, execution becomes deliberate. You’re not just acting—you’re iterating with purpose. Like in Lean Startup, AI First doesn’t skip straight to building. It starts upstream, in the planning conversations that shape what gets built.&#x20;\n\n***\n\n## AI First Enterprise with Amazon Q Business and Amazon Q Business Apps\n\nWhen I talk about using AI as a compass rather than just acceleration, the question naturally becomes: where do you start? How do you implement an AI First mindset in a way that's secure, governed, and actually practical for your organization?\n\nThis is where Amazon Q Business becomes your go-to AI-first toolbox.\n\n<Youtube id=\"JZsu6Mh9KuI\" />\n\n### The Enterprise AI Challenge: Security Meets Innovation\n\nMost organizations face a fundamental tension: they recognize AI's transformative potential but can't sacrifice security and governance. Public AI tools like ChatGPT or Claude are powerful, but they weren't designed with enterprise data security as a foundational requirement. Your company's confidential documents, customer data, and proprietary processes need protection that general-purpose AI simply can't provide.\n\nAmazon Q Business solves this by being built security-first from the ground up. It understands and respects identities, roles, and permissions, ensuring personalized interactions based on user access levels. If a user is not permitted to access certain data without Amazon Q, they cannot access it using Amazon Q either. This isn't security bolted on afterward—it's security woven into the fabric of how the system operates.\n\n### Your Data, Your Intelligence\n\nHere's what makes Amazon Q Business different: it becomes intelligent about *your* business by connecting to *your* data sources. Amazon Q Business supports connectors for over 40 enterprise systems including Amazon S3, Microsoft SharePoint, Confluence, Salesforce, Jira, Gmail, Google Drive, Microsoft Teams, Box, Dropbox, and many more.\n\nThis means you can ask questions like:\n\n* \"What were the key decisions from last quarter's board meetings?\" (pulling from SharePoint)\n* \"Show me all customer feedback about our new product feature\" (combining Salesforce, Zendesk, and email data)\n* \"What's our current project status across all teams?\" (integrating Jira, Confluence, and Slack)\n\nThe AI doesn't just search—it synthesizes information across all these sources while respecting the permissions you already have in place.\n\n### From Conversations to Applications: Amazon Q Business Apps\n\nBut here's where it gets really interesting. Remember how I mentioned that AI First isn't just about faster execution—it's about starting with the right questions? Amazon Q Business Apps takes this concept and makes it scalable across your organization.\n\nYou can rapidly create generative AI-powered, secure, reusable, and customizable apps by describing them in natural language. Amazon Q Apps intelligently captures the context, nuances, and specifics of your conversation, translating them into a customized app tailored to your needs.\n\nLet's say you have a conversation with Amazon Q Business about analyzing weekly sales performance. Instead of repeating that same conversation every week, Amazon Q Apps can capture that workflow and turn it into a reusable application that anyone in your sales team can use.\n\n<Youtube id=\"hGnTmL4Fsl4\" />\n\n### The Security and Governance You Need\n\nWhat makes this enterprise-ready? All data sources, associated user permissions, and guardrails are preserved when using Amazon Q Apps. Administrators can leverage controls to give additional credibility to user apps with app verification, create customized library labels to meet customer-specific organizational requirements, and enable or disable the Amazon Q Apps creation and run features.\n\nThis governance layer means your IT team stays in control while empowering business users to build AI-powered solutions. It's the sweet spot between innovation and security that most organizations struggle to find.\n\n### The AI First Implementation Path\n\nThink of Amazon Q Business as your training wheels for AI First thinking. You start by asking better questions of your existing data. As you develop comfort and see results, you begin creating apps that capture and scale your most valuable AI workflows.\n\nThis isn't about replacing your existing tools—it's about adding an intelligent layer that helps you navigate them more strategically. Your Confluence pages, Salesforce records, and email threads become nodes in a larger intelligence network that you can query conversationally.\n\n### Start Where You Are\n\nThe beauty of this approach is that you don't need to transform everything at once. Pick one high-volume, information-heavy process in your organization. Maybe it's employee onboarding, where new hires constantly ask the same questions about policies and procedures. Or perhaps it's sales enablement, where your team needs quick access to competitive intelligence scattered across different systems.\n\nConnect those data sources to Amazon Q Business. Start asking questions. See how the AI synthesizes information you previously had to hunt for manually. Then, once you find a valuable pattern, capture it as an Amazon Q App that others can use.\n\nThis is AI First in practice: starting with clarity about what you need to know, using AI to navigate toward better insights, then scaling that intelligence across your organization.\n\n<Youtube id=\"SKC5IrzAVfQ\" />\n\nThe compass analogy isn't just metaphorical—Amazon Q Business literally helps you orient yourself in your organization's information landscape, find the most direct path to answers, and create navigational tools others can follow.\n\nYour next step? Identify one information-heavy challenge in your organization and ask yourself: \"What questions do I wish I could ask across all our systems?\" That's your starting point for an AI First transformation.\n\n***\n\n## Learn More\n\n* [Amazon Q Documentation](https://docs.aws.amazon.com/amazonq/#amazon-q-business)\n* [What is Amazon Q Business?](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/plugins.html)\n* [How Amazon Q Business works](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/how-it-works.html)\n* [Plugins for Amazon Q Business](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/plugins.html)\n* [Amazon Q Business Supported Connectors](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/connectors-list.html)\n* [Amazon Q custom connector to Amazon Q Business](https://community.aws/content/2kxIjlixM8mj5uFJrDrZ0b3ZLSq/amazon-q-custom-connector-to-amazon-q-business)\n* [Creating purpose-built *Amazon Q Apps*](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/purpose-built-qapps.html)\n* [Amazon Q Apps, now generally available, enables users to build their own generative AI apps](https://aws.amazon.com/blogs/aws/amazon-q-apps-now-generally-available-enables-users-to-build-their-own-generative-ai-apps/)\n* [Course: A Hands-On Look at Amazon Q Business Expert](https://explore.skillbuilder.aws/learn/courses/19024/a-hands-on-look-at-amazon-q-business-expert/lessons/147423/a-hands-on-look-at-amazon-q-business-expert)\n* [Learning Plan: AWS SimuLearn: Generative AI Practitioner](https://explore.skillbuilder.aws/learn/learning-plans/2451/plan)\n&nbsp;","status":"LIVE","title":"AI First Imperative: What Does It Mean to Be AI First"}],"nextToken":"eyJpZCI6IjJ4d1hWY3BQdGRUYk5mb2RzSDhZbFVTYkFOViIsImZlZWROYW1lIjoiL3VzZXIvZTBhMDAzMWMtODkwMC00Nzg5LWFkZGYtZTk1MTU0ZGM5NWE4In0"}