{"feedContents":[{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2y6nQgj1FVuaJIn9rFLThIslwaJ","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"Yes, it says micromanagement - and this time it makes sense.","heroImageUrl":"https://assets.community.aws/a/2yxHzwMqvqa605bKfArJPkWGZLX/micr.webp?imgSize=1000x525","tags":["amazon-q-developer","amazon-q-cli","genai","micromanageddrivendevelopment"],"versionId":"2yxY2mrpBMYTErPCBPOwx43laUg"}},"createdAt":1750777486884,"isLiked":false,"lastModifiedAt":1750777522044,"lastPublishedAt":1750774663797,"likesCount":15,"markdownDescription":"The first time I integrated AI into my IDE, I was cocky. I typed \"make a Gmail clone that uses a JSON file for content\" and watched in amazement as it actually worked. The demo was flawless - I felt like a wizard.\n\nA few days later, reality hit. I needed to make it responsive for mobile demos. Simple request, right? Wrong. The AI suggestions broke everything. The layout collapsed, features disappeared, and each \"fix\" created three new problems. Worse? No version control. I couldn't even go back to my working demo.\n\nGame over. I felt scammed.\n\nThe problem is simple: AI gives you working code fast, but it doesn't give you understanding or control. You're flying blind on every modification, hoping the next suggestion won't break everything. When it inevitably does, you're stuck with code you can't fix because you never really understood it in the first place.\n\nAnd don't even start talking about hallucinations.\n\nWhat if I told you that the secret for success has been always in front of us, even worse, we spent years giving it bad reputation. It's already on the title, but let me say it again: **MICROMANAGEMENT**.\n\n## What is Micromanagement you ask?&#x20;\n\nGlad you did...\n\nMicromanagement, stripped of its workplace baggage, is simply a systematic approach to maintaining control through granular oversight. In procedural terms:\n\n* **Break down complex tasks** into smaller, reviewable components\n* **Validate each step** before proceeding to the next\n* **Document decisions and rationale** for future reference\n* **Maintain feedback loops** to course-correct quickly\n* **Never delegate without verification** of outcomes\n\nIt's not only being controlling - it's about being systematic controlling.\n\n## Introducing Micromanaged Driven Development (MDD)\n\nDear humans, here's the developing guidelines that turns AI from your unpredictable enthusiastic intern into your **obsessively supervised** assistant.\n\nMDD is built on three principles:\n\n* **Every decision goes through me** - AI suggests, I ask, I iterate with AI and then I decide\n* **Document everything -** documents are the glue that holds the world together\n* **One small change at a time** - Big changes lead to big disasters\n\n## See MDD in Action\n\nWant to see how this obsessive supervision actually works? Check out this demo where I build a feature using MDD with Amazon Q Developer. Notice how every AI suggestion gets questioned, refined, and documented before implementation.\n\n<Youtube id=\"nVMO0FzL_Lk\" />\n\n## What You Get with MDD\n\nWhen you embrace your inner micromanager, here's what happens:\n\n* **Fewer \"what happened here?\" moments** - You know exactly what changed and why\n* **Faster debugging** - Your documentation trail leads you straight to the problem\n* **Code you actually understand** - Because you questioned every piece of it\n* **Confidence in modifications** - Small, documented changes are easy to roll back\n* **Better AI suggestions over time** - The AI learns your patterns through iteration\n\n## Getting Started: Your First MDD Session\n\nReady to micromanage your way to better code? Here's how to start:\n\n1. **Set up your documentation system** - Check the [MDD GitHub repo](https://github.com/robertoallende/micromanaged-driven-development) for templates showing exactly how to document your AI interactions and decisions.\n2. **Practice the questioning habit** - For every AI suggestion, ask \"Why this approach?\" \"What are the alternatives?\" \"What could go wrong?\"\n3. **Start small** - Pick a minor feature or bug fix for your first MDD experiment.\n\nBut there's one more thing... MDD itself has been written following MDD principles. Want proof? Check [the commit history](https://github.com/robertoallende/micromanaged-driven-development/commits/main/) in the GitHub repo. Every decision, every iteration, every AI interaction is documented. It's MDD all the way down.\n\n## Try Now!\n\nThink I'm crazy? Prove me wrong. Try MDD on your next AI coding session. I guarantee you'll either love the control or hate the extra work - but either way, you'll know exactly what your code is doing. Share your results - success stories, failures, improvements.&#x20;\n\nJoin the growing community of micromanagers that succeed coding with AI.\n&nbsp;","status":"LIVE","title":"Code with AI: Micromanagement is all you need"},{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2y6VTiNmyMKGnFslikzXkfecPd9","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"June 4-5, 2025 saw AWS bring together thousands of developers, builders, and business leaders at Sydney's International Convention Centre for their annual Summit. Across 90+ sessions and 80+ partner showcases, the event highlighted both where AWS is directing their efforts and how customers are putting those tools to work Amazon— here are five things that stood out to me from the two days.","heroImageUrl":"https://assets.community.aws/a/2y6XrHseie0wDzZnqjmJ0ZWgYlW/Fram.webp?imgSize=1000x525","tags":["agentic-ai","leadership","data-lakes","cost-optimization","modernization"],"versionId":"2y7PHURAlXDwrXQfzPPDqykO6zS"}},"createdAt":1749182550118,"isLiked":false,"lastModifiedAt":1749182652710,"lastPublishedAt":1749182530853,"likesCount":6,"markdownDescription":"## The Challenge of Choice\n\nWith 220 scheduled sessions spread across the two-day event, I created a word cloud from the session titles to visualize the key themes (pictured below). What immediately became clear was the breadth of topics covered—from generative AI and data analytics to security, migration, and developer tools. The resulting visualization perfectly captures the current state of cloud computing: AI and DATA dominating the conversation, but with traditional concerns like security, data management, and business transformation remaining equally critical.\n\n![](https://assets.community.aws/a/2y6ZUsHT4ccKtQ3ML5JRPp41MaM/Fram.webp?imgSize=1000x525)\n\nThe permanent challenge throughout the summit was deciding which session to attend, with at least five or more tracks running simultaneously at any given time. This abundance of choice, while sometimes overwhelming, reflected the maturity and diversity of the AWS ecosystem. Whether you were a startup founder looking to scale, an enterprise architect planning a migration, or a developer exploring the latest AI tools, there was genuinely something for everyone.\n\nBefore diving into my five key takeaways, it's worth acknowledging the topics that deserve dedicated posts of their own. **Security** was a major focus throughout the summit, with AWS showcasing how they're serving all major Australian banks including ANZ and Westpac. The trust these institutions place in AWS infrastructure speaks volumes about the platform's enterprise-grade security capabilities, and the dedicated security track offered deep dives into everything from compliance frameworks to threat detection.\n\nSimilarly, **cloud computing and scaling** emerged as a persistent theme. One standout was hearing **Brendan Humphreys** share insights into how Canva is scaling their platform to serve millions of users globally. These real-world scaling stories from Australian companies provided practical insights that went far beyond theoretical discussions.\n\n## The Human Element in Technology Transformation\n\n> **What would happen if you could think beyond your own constraints?**\n> Phil Le-Brun\n\nAcross the two keynote sessions—Builders Day featuring Rianne van Veldhuizen and Francesca Vasquez, and Innovation Day with Rada Stanic and Phil Le-Brun—a consistent theme emerged that went beyond the impressive technical capabilities on display. While the AWS executives showcased everything from custom silicon to multi-region databases, it was Phil Le-Brun's message about **organizational change** that provided perhaps the most practical takeaway for attendees. His central argument was both simple and profound: \"*while we can solve every problem we can imagine with technology today unless we change how we work and the skill sets we have nothing changes.*\" This insight reframed the entire summit discussion, suggesting that the real barrier to innovation isn't technological limitation but our own organizational constraints and imagination.\n\n![The only thing that's limiting us is our imagination - Le-Brun challenges us to take ownership.](https://assets.community.aws/a/2y71XzTCtykjpo8RQhnh9VtFOW7/Fram.webp?imgSize=1000x525 \"The only thing that's limiting us is our imagination - Le-Brun challenges us to take ownership.\")\n\nLe-Brun's approach to organizational transformation centers on what he calls Amazon's \"Day One\" culture—a philosophy built on three foundational pillars that any organization can adopt.&#x20;\n\nFirst is **clarity**: ensuring everyone understands the organization's purpose and priorities. He suggested a simple but revealing test: \"pick 10 people at random, ask them what is the purpose of your organization and what are the top three priorities—data tells us most answers will be different.\" The second pillar is **ownership**, moving beyond job descriptions to give people accountability for meaningful business outcomes. Using the \"pig and chicken\" metaphor, he emphasized finding the person who wakes up every morning asking \"are we making progress towards a meaningful outcome?\" The third pillar, **curiosity**, addresses what he sees as a critical gap in organizational learning. \"*Did you know that if you're a five-year-old kid you probably ask up to 100 questions a minute... by the time you're 15 it's down to about three*,\" he noted, arguing that organizations systematically train people to stop asking questions—which is \"deadly to innovation.\"\n\nLe-Brun's message wasn't just theoretical—he provided concrete examples that resonated throughout the developer-heavy audience. He cited a striking statistic that \"*the average developer in large enterprises spends five hours a week developing*,\" meaning most are done with actual coding by Monday lunchtime, with the rest of their time consumed by meetings, waiting for decisions, and navigating gatekeepers. This waste of human potential, he argued, can't be solved by tools like Amazon Q Developer alone if the underlying organizational dysfunction remains unchanged. His solution involves creating smaller, empowered teams—Amazon's famous \"two pizza teams\"—that combine cross-functional skills with clear business outcomes and the autonomy to deliver them. He challenged leaders to \"be like a teenager, be curious about the technology\" while also being \"humble\" enough to admit uncertainty, \"think big\" rather than settling for incremental 10% improvements, and most importantly, \"set your builders free\" by removing the bureaucratic layers that constrain front-line talent.\n\nWhat made Le-Brun's presentation particularly powerful was how it recontextualized every other session at the summit. Whether attendees were learning about the latest AI models in Amazon Bedrock, exploring serverless architectures, or diving into security best practices, his message served as a reminder that successful technology adoption requires parallel investment in organizational change. His historical perspective—drawing parallels between today's AI revolution and the Industrial Revolution—helped frame current disruptions not as unprecedented challenges but as part of a recognizable pattern where \"*new skills and technology opens up a whole new world of opportunity*.\" This human-centered approach to transformation provided a grounding counterpoint to the technical excitement throughout the summit, suggesting that while AWS continues to democratize access to powerful technologies, the organizations that will truly benefit are those willing to evolve how they work, learn, and make decisions. In essence, the most sophisticated cloud infrastructure in the world is only as transformative as the people and processes that leverage it. \n\n## Tech Debt Is the Silent Killer of Innovation\n\nOne of the most compelling themes across multiple sessions was how technical debt has become the invisible barrier preventing organizations from leveraging modern capabilities like AI and cloud-native architectures. The reality presented across three powerful case studies is both sobering and hopeful: while legacy systems are quietly strangling organizational agility, AI-powered tools are now making modernization faster than ever before.\n\n#### The Hidden Cost of Standing Still\n\nThe numbers tell a stark story. As Bilal Alam, AWS Specialist Solutions Architect for AI/ML, revealed, talented engineers in large organizations spend only **13% of their time actually writing code**. The remaining 87% disappears into \"undifferentiated heavy lifting\"—patching security vulnerabilities, upgrading frameworks, and maintaining systems that should have been modernized years ago.\n\nThis isn't just a productivity problem; it's an innovation killer. One local enterprise customer discovered that modernizing their hundreds of legacy applications would cost between $200,000 for simple apps to over $1 million for complex systems—money spent just to maintain current functionality, not add new capabilities.\n\n#### When Legacy Becomes a Business Liability\n\nDymocks' transformation journey provided a perfect case study. Their Product Information Management system—managing 40 million SKUs—consumed over **$250,000 annually** just to operate three servers, required a full day to reboot, and demanded a dedicated three-person team for 24/7 maintenance. As Saif Abdallah, Head of Architecture and Transformation, described it: \"a beautiful legacy train that belongs in a museum.\"\n\n#### The AI-Powered Solution\n\nWhat's changed dramatically is how generative AI is accelerating modernization timelines. **Amazon Q Developer** now allows teams to submit entire application repositories and receive modernized code in hours. Alam's customer used a five-person team to upgrade 1,000 Java applications from version 8 to 17 in just **two days**—each application taking an average of 10 minutes.\n\nDymocks achieved even more dramatic results, reducing infrastructure costs by **90%** while improving capabilities. Product updates that previously happened once daily now occur every 30 minutes across their entire catalog.\n\n#### The Strategic Framework\n\nAWS's approach, refined across hundreds of migrations, breaks modernization into three phases: **assess, mobilize, and migrate/modernize**. The key insight from all presentations: don't try to \"boil the ocean.\" Start with high-impact, lower-risk applications to build confidence and capabilities.\n\n![Evgeny Vaganov presents AWS's three-step cloud migration approach](https://assets.community.aws/a/2y73KUFjocP2kb7LvPBTWOMrOv3/Fram.webp?imgSize=1000x525 \"Evgeny Vaganov presents AWS's three-step cloud migration approach\")\n\nAs Evgeny Vaganov noted from his experience across hundreds of customer journeys, successful modernization requires more than powerful tools—it demands organizational alignment and a shift toward continuous modernization rather than periodic \"big bang\" projects.\n\nThe summit's message was clear: with AI-powered tools reducing modernization friction, the competitive advantage belongs to organizations that can continuously evolve their technology stack rather than letting technical debt accumulate until a crisis forces action.\n\n## Real-Time Data Lakes: From Operational Silos to Unified Analytics\n\nOne of the most technically compelling sessions at the summit tackled a challenge that resonates across virtually every enterprise: how to bridge the gap between operational databases and analytical systems without sacrificing real-time capabilities or transactional integrity. Masudur Rahaman Sayem's deep dive into \"architecting real-time transactional data lakes\" revealed both the complexity of modern data architectures and the sophisticated solutions now available to tame them.\n\n#### **The Reality of Fragmented Data**\n\nThe traditional model of applications pointing directly to databases no longer reflects how modern organizations generate and consume data. As Sayem outlined, today's enterprises face a \"diverse ecosystem of devices, applications, and microservices generating data that are no longer relying on database as the first entry point.\" Whether it's a FinTech company needing to sync PostgreSQL transactional data for machine learning models, or a gaming platform requiring partition evolution capabilities for massive datasets, the demand for unified analytics has never been higher.\n\nThe challenge extends beyond simple data movement. Organizations need consistent views across operational and analytical systems, scalable platforms that can grow with their data volumes, and unified access that doesn't lock them into engineer-specific formats. Most critically, they need this unification to happen in real-time, not through batch processes that create hours or days of lag.\n\n![Masudur Rahaman Sayem: \"The data lake is fundamentally different than database.\"](https://assets.community.aws/a/2y78c4pYDsGIKChtn49TRqaLPln/Fram.webp?imgSize=1000x525 \"Masudur Rahaman Sayem: \\\"The data lake is fundamentally different than database.\\\"\")\n\n#### **The Hidden Complexity of Data Lake Management**\n\nWhat makes this particularly challenging is that data lakes are \"fundamentally different than databases.\" While databases excel at continuous insert, update, and delete operations, data lakes traditionally struggle with these same operations, leading to data consistency issues and performance degradation over time. Organizations find themselves caught between the operational agility they need and the analytical capabilities they want, often requiring separate systems that create data silos and integration headaches.\n\nThe infrastructure burden compounds these challenges. Self-managed connectors for Change Data Capture (CDC) require dedicated teams for provisioning, capacity planning, and ongoing maintenance. As Sayem noted from his experience with hundreds of customers, teams often provision for peak loads, cannot scale down to zero during quiet periods, and struggle with the IO-bounded nature of streaming workloads that don't respond well to traditional CPU-based scaling policies.\n\n#### **The Apache Iceberg and Amazon Data Firehose Solution**\n\nThe answer lies in combining Apache Iceberg's database-level capabilities with Amazon Data Firehose's fully managed data delivery. Iceberg brings transactional integrity to data lakes, supporting massive datasets with billions of rows while providing schema evolution, time travel capabilities, and ACID transactions. Its two-layer architecture—metadata for transactional features and data layer for storage—delivers the reliability of databases with the scale of data lakes.\n\nAmazon Data Firehose eliminates the infrastructure management burden entirely. Rather than deploying and maintaining CDC connectors, organizations can create streams that automatically provision, scale, and manage the data pipeline. The service supports real-time delivery with buffer configurations from 0 seconds to 900 seconds, allowing teams to balance latency against write optimization based on their specific needs.\n\n#### **Practical Implementation and Governance**\n\nWhat stood out in Sayem's presentation was the attention to real-world implementation challenges. Data Firehose's routing capabilities allow sophisticated data distribution—from simple JSON query expressions for single-table destinations to complex AWS Lambda functions for multi-table routing with transformation logic. The service handles insert, update, and delete operations while supporting exactly-once delivery and automatic schema evolution.\n\nFor organizations dealing with compliance requirements, the platform provides encryption with both AWS-managed and customer-managed keys, secret management integration for database credentials, and comprehensive monitoring through CloudWatch. Cross-account connectivity through MSK's multi-VPC capabilities ensures that security boundaries remain intact while enabling data flow.\n\nThe summit's message was clear: the days of choosing between operational agility and analytical depth are ending. With managed services handling the complexity of real-time data lake architectures, organizations can focus on extracting value from unified data rather than managing the infrastructure that delivers it. As data volumes continue to grow and real-time requirements become standard, the competitive advantage belongs to those who can seamlessly blend operational and analytical workloads without sacrificing either performance or governance.\n\n## Agents: From Distributed Systems to Autonomous Intelligence\n\nPerhaps no topic captured more attention across technical, strategic, and business audiences at the summit than the evolution of AI agents. What emerged from multiple sessions was a fascinating convergence: the distributed systems patterns that architects have used for decades are now the foundational blueprints for building intelligent, autonomous systems that can reason, plan, and act without human intervention.\n\n![Ben Hillman quoting Jeff Bezos on the promise of AI agents to simplify and enhance our lives.](https://assets.community.aws/a/2y7HzfoI5FyT81QdZUGgBWQijRP/Fram.webp?imgSize=1000x525 \"Ben Hillman quoting Jeff Bezos on the promise of AI agents to simplify and enhance our lives.\")\n\n#### The Architecture Behind the Intelligence\n\nAndrew Hooker's analysis of agent workflow patterns demonstrated how traditional distributed systems architectures map directly to modern agentic systems. Prompt chaining mirrors event choreography, routing patterns become intelligent classifiers, and parallelization enables scatter-gather approaches where multiple agents can independently reason over portions of complex problems. The difference is that instead of static rules determining workflow paths, LLMs dynamically interpret intent and adapt routing based on context.\n\nThis architectural foundation explains why organizations are suddenly able to tackle problems that seemed intractable just months ago. BGL's journey from single-agent implementations to sophisticated multi-agent systems illustrates the practical impact: what started as a 30-page prompt managing 100 different functions evolved into specialized agents that can complete complex compliance workflows that previously required two to three hours of concentrated human effort—now targeting 30-minute completion times with autonomous execution.\n\n![Andrew Hooker presenting a comprehensive overview of AI agent architecture patterns](https://assets.community.aws/a/2y7JHGtp2HKdZj82Vz6kw0UZ7Up/Fram.webp?imgSize=1000x525 \"Andrew Hooker presenting a comprehensive overview of AI agent architecture patterns\")\n\n#### From Proof of Concept to Production Reality\n\nThe most compelling insights came from James Luo's candid account of BGL's progression to production multi-agent systems serving 300,000 funds representing $500 billion in assets. As James Luo explained, \"the prompt grows up to 30 pages just to explain what to call and when, as the prompt grow up, so do the cost and the latency.\" The solution wasn't more powerful models—it was better architecture through specialized agents with narrowly defined responsibilities.\n\nThe customer impact speaks for itself. Where users previously navigated between 60+ screens and hundreds of buttons, they can now upload a hand-drawn sketch and watch the system instantly understand their intent and execute appropriate actions. What makes BGL's approach particularly noteworthy is their measurement framework: success is quantified by \"how many hours of human effort your agent can take off your client's plate.\"\n\n#### The Integration Challenge and Strategic Future\n\nMithil Shah's exploration of Model Context Protocol (MCP) addressed one of the most pressing challenges: connecting intelligent systems to enterprise tools without creating integration nightmares. MCP transforms the traditional M×N integration problem into an M+N pattern by standardizing how AI applications communicate with external resources—essentially \"USB for AI applications.\"\n\n#### The Business Case for Autonomous Operations\n\nThe workshop sessions revealed how forward-thinking organizations are approaching agentic AI as a strategic capability that can reshape entire business processes. Melanie Li and James Luo highlighted the progression from conversational chatbots to specialized agents that perform specific tasks—like the legal team that reduced 80% of their time spent on routine employee queries by deploying a legal agent connected to internal knowledge bases.\n\nThe business transformation extends beyond efficiency gains. Organizations are discovering they can eliminate entire categories of manual work: BGL's clients can now submit complex compliance requests through sketches rather than navigating dozens of screens, while the underlying agents handle multi-step workflows autonomously. This shift represents a fundamental change from designing user interfaces to designing experiences where agents become the primary interface.\n\nFor business leaders, the key insight was that agentic AI succeeds when organizations are willing to \"give up control\"—not to the technology itself, but to new ways of designing processes where agents handle workflow orchestration while humans focus on outcomes and exceptions. The technology has reached a remarkable threshold: Claude 3.5 Sonnet can now complete half of the tasks that take humans 50 minutes to do, with this capability doubling every seven months. Organizations that master these architectural patterns will be positioned to capture value as autonomous systems become the primary interface between businesses and their customers.\n\n## Cost Optimization: Beyond Tools to Cultural Transformation\n\nCost optimization emerged as a critical theme throughout the summit, with two standout sessions demonstrating how organizations can move beyond reactive \"panic optimization\" to build sustainable, data-driven financial management practices.\n\n![Anushree Umesh and Jane Yin connected Frugal Architecture laws with AWS tools in an engaging session](https://assets.community.aws/a/2y7NPLRqKwogIfaK8S70l6ztAoZ/Fram.webp?imgSize=1000x525 \"Anushree Umesh and Jane Yin connected Frugal Architecture laws with AWS tools in an engaging session\")\n\n#### **The Power of Intelligent Usage Detection**\n\nNational Australia Bank's collaboration with AWS showcased a sophisticated approach to dynamic cost optimization that goes far beyond traditional tag-based scheduling. Their journey from static, preset schedules to intelligent power management illustrates the potential of using VPC flow logs and CloudTrail data to understand actual application usage patterns.\n\nThe results speak volumes: supporting close to 500 applications across 2,000+ non-production environments, NAB has transformed cost management from an optional task into standard operating procedure. As Chaitanya Krant noted, \"This is not a one-time win in our case. It is a continuous improvement process.\" Their open-source solution, released during the summit, enables other organizations to scan their environments and identify optimization opportunities without installing agents or disrupting existing applications.\n\n#### **Beyond Tools: Building Cost-Aware Culture**\n\nPerhaps more importantly, the sessions emphasized that successful cost optimization requires organizational transformation alongside technical solutions. Sid Jolapara's framework highlighted five critical pillars: executive sponsorship, active finance engagement, dedicated resources, robust processes and tools, and most crucially, building a cost-aware and value-aware culture.\n\nThe sobering reality is that engineering teams already know where optimizations exist—the challenge lies in creating sustainable practices to implement them. Without cultural change, organizations fall into the cycle Jolapara described: \"the spend goes up, there's a moment where they freak out... they optimize... and then six months later, we're just back up to where it was.\"\n\n#### **New AWS Capabilities Making Optimization Easier**\n\nThe summit also introduced several new AWS features addressing the top FinOps priorities: idle resource recommendations in AWS Compute Optimizer, database optimization recommendations for RDS and Aurora, and the new Savings Plan Purchase Analyzer for more strategic commitment-based purchasing. These tools reflect AWS's focus on making optimization decisions more data-driven and less dependent on guesswork.\n\nThe cost optimization track included numerous lightning talks and hands-on workshops that provided practical guidance for implementing these strategies. The consistent message across all sessions: the most sophisticated cost management tools are only as effective as the organizational commitment to use them systematically and strategically.\n\n## **Closing Thoughts**\n\nAWS Summit Sydney 2025 was an incredible experience that delivered both deep technical insights and valuable leadership lessons. From hands-on workshops that challenged us to think like AI agents to inspiring keynotes that outlined the future of cloud innovation, every session offered something meaningful to take back to our organizations.&#x20;\n\n![Just me, casually stealing the stage for a photo—fake it until you make it, they say 😀](https://assets.community.aws/a/2y7Ke0bLhqN1bZkI4IL1kZ2owsF/Fram.webp?imgSize=1000x525 \"Just me, casually stealing the stage for a photo—fake it until you make it, they say 😀\")\n\nThe energy and collaboration throughout the event reminded me why these industry gatherings are so valuable – not just for the knowledge shared, but for the connections made and perspectives gained. I'm already looking forward to AWS Summit Sydney 2026, eager to see how the landscape will have evolved and what new innovations AWS will unveil. Until then, there's plenty of work to do implementing these takeaways!\n\n## **Session Recordings**\n\nAll keynotes and sessions from AWS Summit Sydney 2025 are available to watch online at [https://summitsydney.awslivestream.com](https://summitsydney.awslivestream.com). Whether you want to revisit a particular session or catch up on presentations you missed, these recordings are a valuable resource for continuing your AWS learning journey.\n\n**Copyright Notice**\n\nThe workshop materials and content referenced in this post are the intellectual property of Amazon Web Services, its subsidiaries, or their authors. This blog post is intended purely for educational and learning purposes, sharing insights from the AWS Summit Sydney 2025 experience. If you believe any content requires modification or removal, please feel free to contact me and I will address your concerns promptly.\n&nbsp;","status":"LIVE","title":"Five Takeaways from AWS Summit Sydney 2025"},{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2uTxBHfOqBru2fkVYGFg1023pXp","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"I’ve been practicing an AI First mindset for a few months now. It wasn’t something I defined from the start—it just emerged naturally from how I worked. Whether I was tackling a complex project, debugging a technical issue, or drafting a message, AI became a central part of my thinking loop.","heroImageUrl":"https://assets.community.aws/a/2xw6QV2bvJVewgjSA6T2k8g6cEv/Fram.webp?imgSize=1000x525","tags":["generative-ai","amazon-q","sharepoint","confluence","startups"],"versionId":"2uTxBG2dXa14pbb2xfg0wS2J07B"}},"createdAt":1742286227216,"isLiked":false,"lastModifiedAt":1748850134779,"lastPublishedAt":1748850134655,"likesCount":2,"markdownDescription":"## **The Genie Curse**\n\n> “AI is not accurate.”\n> “AI hallucinates.”\n\nWell—so do humans.\n\nAfter years building, mentoring, working with startups and judging in funding programs, I’ve seen it over and over again: we hallucinate too. We imagine product-market fit. We assume customer needs. We fall in love with our own ideas. Sometimes we’re right. Often, we’re not.\n\nBut here’s the twist: hallucination isn’t a flaw—**it’s a feature.** It’s fuel for creativity. Without it, there’d be *no misfits, no rebels, no troublemakers*—no one daring to build what doesn’t yet exist.\n\n<Youtube id=\"mtftHaK9tYY\" />\n\nIn myths, genies grant wishes. But the curse is built in:\nYou get what you ask for—even if it destroys you.\nThe genie doesn’t question your assumptions.\nIt doesn’t clarify your intent.\nIt just delivers. No matter the consequences.\n\nThat’s the danger—not just false information, but false direction.\n\nThis is the problem the *Lean Startup* tried to solve. Every product begins as a wish—a hypothesis. But instead of trusting the wish, it proposes a loop to test it:\n\n![Build -> Measure -> Learn](https://assets.community.aws/a/2xvzZ8mU9UxUD49G52mf7LZjix3/Buil.webp?imgSize=1000x525 \"The Lean Startup Learning Cycle\")\n\nIf it works, keep going. If not, pivot—fast.\nThe sooner you find what’s wrong, the sooner you can get it right.\n\n***\n\n## **What Does It Mean to Be AI First?**\n\nThe genie curse has a cousin: the curse of knowledge—when you’re so deep in an idea, you forget what it’s like not to know. That’s how I felt writing this. I didn’t just want to explain *AI First*—I wanted it to stick.\n\nSo I did what any AI First practitioner would do:\nI asked the machine.\n\nWhat emerged was this:\n\n> **AI First: Don’t just move fast—start smart.**\n> Most people use AI like a car—to go faster.\n> I use it like a compass.\n\nBefore I move, I ask: `Where am I?, What’s the terrain?, What’s the smartest route?`\n\nIt’s not about speed. It’s about clarity.\nNot just accelerating execution—but sharpening intent.\n\nAt first, I called AI a “**strategic amplifier**.” Technically accurate—but abstract.\nSo I tested metaphors.\n\nThe genie metaphor worked. It captured AI’s power—but also its danger. The idea was sticky, but not trustworthy. I needed something better—familiar, grounded, directional.\n\nThat’s when the compass appeared.\nNot magic. Strategy.\nNot wishes. Navigation.\n\nThat shift clarified everything: *AI First* isn’t about working faster.\nIt’s about working smarter—by thinking with the machine *before* acting.\n\nIt’s a mindset.\nA process.\n\nThe conversation didn’t begin with a prompt like:\n\n> “Write a post about AI First.”\n\nIt started with questions—shaped through conversations like:\n\n> “What are the best books on communicating complex ideas?”\n> “How do you pitch a concept so it sticks?”\n> “What makes an abstract idea like AI First feel intuitive?”\n\nEach question refined the intent. Each answer sharpened the metaphor.\n\nBecause that’s what AI First *really* means:\nStart with the question—before the task.\nStart with direction—before acceleration.\nStart with the compass.\n\n## **Execution**\n\nOnce the intent is clear, execution becomes deliberate. You’re not just acting—you’re iterating with purpose. Like in Lean Startup, AI First doesn’t skip straight to building. It starts upstream, in the planning conversations that shape what gets built.&#x20;\n\n***\n\n## AI First Enterprise with Amazon Q Business and Amazon Q Business Apps\n\nWhen I talk about using AI as a compass rather than just acceleration, the question naturally becomes: where do you start? How do you implement an AI First mindset in a way that's secure, governed, and actually practical for your organization?\n\nThis is where Amazon Q Business becomes your go-to AI-first toolbox.\n\n<Youtube id=\"JZsu6Mh9KuI\" />\n\n### The Enterprise AI Challenge: Security Meets Innovation\n\nMost organizations face a fundamental tension: they recognize AI's transformative potential but can't sacrifice security and governance. Public AI tools like ChatGPT or Claude are powerful, but they weren't designed with enterprise data security as a foundational requirement. Your company's confidential documents, customer data, and proprietary processes need protection that general-purpose AI simply can't provide.\n\nAmazon Q Business solves this by being built security-first from the ground up. It understands and respects identities, roles, and permissions, ensuring personalized interactions based on user access levels. If a user is not permitted to access certain data without Amazon Q, they cannot access it using Amazon Q either. This isn't security bolted on afterward—it's security woven into the fabric of how the system operates.\n\n### Your Data, Your Intelligence\n\nHere's what makes Amazon Q Business different: it becomes intelligent about *your* business by connecting to *your* data sources. Amazon Q Business supports connectors for over 40 enterprise systems including Amazon S3, Microsoft SharePoint, Confluence, Salesforce, Jira, Gmail, Google Drive, Microsoft Teams, Box, Dropbox, and many more.\n\nThis means you can ask questions like:\n\n* \"What were the key decisions from last quarter's board meetings?\" (pulling from SharePoint)\n* \"Show me all customer feedback about our new product feature\" (combining Salesforce, Zendesk, and email data)\n* \"What's our current project status across all teams?\" (integrating Jira, Confluence, and Slack)\n\nThe AI doesn't just search—it synthesizes information across all these sources while respecting the permissions you already have in place.\n\n### From Conversations to Applications: Amazon Q Business Apps\n\nBut here's where it gets really interesting. Remember how I mentioned that AI First isn't just about faster execution—it's about starting with the right questions? Amazon Q Business Apps takes this concept and makes it scalable across your organization.\n\nYou can rapidly create generative AI-powered, secure, reusable, and customizable apps by describing them in natural language. Amazon Q Apps intelligently captures the context, nuances, and specifics of your conversation, translating them into a customized app tailored to your needs.\n\nLet's say you have a conversation with Amazon Q Business about analyzing weekly sales performance. Instead of repeating that same conversation every week, Amazon Q Apps can capture that workflow and turn it into a reusable application that anyone in your sales team can use.\n\n<Youtube id=\"hGnTmL4Fsl4\" />\n\n### The Security and Governance You Need\n\nWhat makes this enterprise-ready? All data sources, associated user permissions, and guardrails are preserved when using Amazon Q Apps. Administrators can leverage controls to give additional credibility to user apps with app verification, create customized library labels to meet customer-specific organizational requirements, and enable or disable the Amazon Q Apps creation and run features.\n\nThis governance layer means your IT team stays in control while empowering business users to build AI-powered solutions. It's the sweet spot between innovation and security that most organizations struggle to find.\n\n### The AI First Implementation Path\n\nThink of Amazon Q Business as your training wheels for AI First thinking. You start by asking better questions of your existing data. As you develop comfort and see results, you begin creating apps that capture and scale your most valuable AI workflows.\n\nThis isn't about replacing your existing tools—it's about adding an intelligent layer that helps you navigate them more strategically. Your Confluence pages, Salesforce records, and email threads become nodes in a larger intelligence network that you can query conversationally.\n\n### Start Where You Are\n\nThe beauty of this approach is that you don't need to transform everything at once. Pick one high-volume, information-heavy process in your organization. Maybe it's employee onboarding, where new hires constantly ask the same questions about policies and procedures. Or perhaps it's sales enablement, where your team needs quick access to competitive intelligence scattered across different systems.\n\nConnect those data sources to Amazon Q Business. Start asking questions. See how the AI synthesizes information you previously had to hunt for manually. Then, once you find a valuable pattern, capture it as an Amazon Q App that others can use.\n\nThis is AI First in practice: starting with clarity about what you need to know, using AI to navigate toward better insights, then scaling that intelligence across your organization.\n\n<Youtube id=\"SKC5IrzAVfQ\" />\n\nThe compass analogy isn't just metaphorical—Amazon Q Business literally helps you orient yourself in your organization's information landscape, find the most direct path to answers, and create navigational tools others can follow.\n\nYour next step? Identify one information-heavy challenge in your organization and ask yourself: \"What questions do I wish I could ask across all our systems?\" That's your starting point for an AI First transformation.\n\n***\n\n## Learn More\n\n* [Amazon Q Documentation](https://docs.aws.amazon.com/amazonq/#amazon-q-business)\n* [What is Amazon Q Business?](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/plugins.html)\n* [How Amazon Q Business works](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/how-it-works.html)\n* [Plugins for Amazon Q Business](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/plugins.html)\n* [Amazon Q Business Supported Connectors](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/connectors-list.html)\n* [Amazon Q custom connector to Amazon Q Business](https://community.aws/content/2kxIjlixM8mj5uFJrDrZ0b3ZLSq/amazon-q-custom-connector-to-amazon-q-business)\n* [Creating purpose-built *Amazon Q Apps*](https://docs.aws.amazon.com/amazonq/latest/qbusiness-ug/purpose-built-qapps.html)\n* [Amazon Q Apps, now generally available, enables users to build their own generative AI apps](https://aws.amazon.com/blogs/aws/amazon-q-apps-now-generally-available-enables-users-to-build-their-own-generative-ai-apps/)\n* [Course: A Hands-On Look at Amazon Q Business Expert](https://explore.skillbuilder.aws/learn/courses/19024/a-hands-on-look-at-amazon-q-business-expert/lessons/147423/a-hands-on-look-at-amazon-q-business-expert)\n* [Learning Plan: AWS SimuLearn: Generative AI Practitioner](https://explore.skillbuilder.aws/learn/learning-plans/2451/plan)\n&nbsp;","status":"LIVE","title":"AI First Imperative: What Does It Mean to Be AI First"},{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2tO2WMlns6zODmiSlZeLCaoKeYb","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"Imagine standing in a photo lab, holding a freshly printed picture, unaware that the very act of developing film is about to vanish. Disruption rarely announces itself with sirens—it creeps in, reshaping industries before most notice. AI isn’t just another innovation; it’s a tidal wave accelerating change. Will you harness it to stay ahead, or risk falling behind? What happens next is up to you.","heroImageUrl":"https://assets.community.aws/a/2uHz0Xri2F18NoWbkjpj4FonNzS/Fram.webp?imgSize=1000x525","tags":["generative-ai","amazon-q","amazon-q-developer","amazon-bedrock","awsdeepracer"],"versionId":"2uUCK6jnhyYOoPCd9eJetrRBIda"}},"createdAt":1742293698754,"isLiked":false,"lastModifiedAt":1742293833615,"lastPublishedAt":1742288456473,"likesCount":2,"markdownDescription":"Why did giants like Kodak, Blockbuster, and Nokia fail? The pattern is so recognizable it has a name: \"The Innovator's Dilemma.\" You can do everything right according to traditional business wisdom and still find yourself disrupted out of existence when technological paradigms shift.\n\nWe all know these cautionary tales of corporate extinction, but let me share my personal journey with technological evolution. Back in high school, I would run 50-meter cables across rooftops just to play Doom with my neighbor. I'd make late-night phone calls to download emails from a local BBS. I still vividly remember my awe when I first experienced text chat through a 2400bps modem, thinking: \"How amazing would it be if everyone communicated this way? We could have conversations with people on the other side of the planet. Continuously and essentially free.\"\n\n![Multiplayer gaming once demanded high technical expertise and specialized hardware to be possible.](https://assets.community.aws/a/2uAQkOKgxSF1FUpb06PQfHYfuwI/450410401_8663318457029079_7244006721234958197_n-jpg.webp?imgSize=604x378 \"Multiplayer gaming once demanded high technical expertise and specialized hardware to be possible.\")\n\n## Be Careful What You Wish For\n\nLike many of you, I've witnessed wave after wave of technological revolution: the web, email, WiFi, IRC evolving into instant messaging, Stack Overflow transforming how we learn to program, mobile phones, smartphones, cloud computing, cryptocurrencies.\n\nMore than a decade ago, Rita McGrath highlighted in her HBR article \"The Pace of Technology Adoption is Speeding Up\" that industries were experiencing accelerated innovation cycles. She pointed to examples like automotive manufacturing, where design cycles had halved from 60 months to just 24-36 months, and consumer technology, where recent innovations were reaching mass adoption significantly faster than their predecessors.\n\n![](https://assets.community.aws/a/2uI8FDcjHBa1MQalDaTiH01xAYI/Fram.webp?imgSize=1000x525)\n\nWith each of these advances, if you traveled back in time just five or ten years and described them, they would have sounded like science fiction. But Generative AI has changed that timeline drastically. Now you only need to go back a few months for it to sound like sci-fi.\n\nAs someone naturally enthusiastic about technology, I spent about two years trying to make sense of machine learning and generative AI before experiencing my own \"wow\" moment. When I rushed to share this epiphany with friends and colleagues, I struggled to convey the magnitude of what I was seeing.\n\nI understand if you're not excited yet—but I believe with absolute conviction that Generative AI is creating a divide that will leave many behind. And I don't want you to be one of them. This isn't dark magic, though it often feels that way. It's not a silver bullet either. The key is keeping an open mind and learning how to use these tools effectively. The reward isn't just moving faster—it's reducing the risk of falling behind.\n\nThat's the core purpose of this AI First Imperative Series. Working from the assumption that some observations about these technological signals and trends are true, I suggest a conversation about preventing obsolescence and focusing on what truly matters.\n\n## From Skeptic to Believer: My GenAI Journey\n\nMy journey with AI began like many others - with healthy skepticism. In October 2022, perhaps influenced by media coverage or sensing the imminent launch of ChatGPT, I started exploring the field and discovered AWS DeepRacer—Amazon's 1/18th scale autonomous racing car designed to help developers learn reinforcement learning through a gamified experience. I even considered purchasing the physical car but hesitated when I couldn't connect it to practical, real-world use cases.\n\nSimultaneously, I explored various ML courses but found most heavily weighted toward theory, requiring substantial time investment in mathematical models or significant budget for meaningful experimentation. I spent about a hundred dollars on DeepRacer credits alone—not insignificant for what was essentially just dipping my toes in the water. Though I successfully trained a virtual car using reinforcement learning, it remained an interesting but isolated experience.\n\n<Youtube id=\"IGemErqrwuc\" />\n\nAs a non-native English speaker, I've always struggled with the subtleties of the language—distinctions between formal and informal tone, navigating UK versus US English conventions. When I discovered ChatGPT, my first use was simply checking if my English was correct. Useful, but hardly revolutionary.\n\nThe next level came when I asked it to rewrite a few paragraphs into \"Pirate English\" for my football team, aptly named \"Los Piratas.\" This experiment was entertaining but still relatively superficial.\n\n![Football Match Chronicles—told in true Pirate English, arrr!](https://assets.community.aws/a/2uAUekf1vkJHsqSshIHvidS6rJL/Fram.webp?imgSize=1000x525 \"Football Match Chronicles—told in true Pirate English, arrr!\")\n\nEventually, I grew tired of writing match chronicles. After discovering Sonauto and Suno, I had the idea to create songs instead of written chronicles for the football matches—and that was my first genuine \"wow\" moment. Throughout the 2024 winter season, I generated about 18 different songs in multiple languages (English, Spanish, and Portuguese) across various genres (Tango, Blues, Rock and Roll, Pop, Hip Hop, Bossa Nova, Jazz, etc). Each song became part of the video highlights for a match, featuring lyrics and musical style tailored to that specific game. By season's end, I had released my first album—a collection of 18 original songs, each describing a different match.\n\n<Youtube id=\"lxQeN7MIqUQ\" start=\"10\" />\n\nWhile this might not sound groundbreaking, consider that I would never have been able to compose music or write rhyming lyrics in three different languages on my own. Even if we're talking about modest musical and lyrical quality, this represented something I simply couldn't have accomplished without AI assistance.\n\n**Do you suffer from impostor syndrome?** I squeezed into John Williams and Hans Zimmer's table without paying the ticket price. Yeah, my job is fake, it isn't \"entirely mine,\" but I was able to share some thoughts and emotions through sounds just like they do. I \"compose\" in at least seven genres, whereas John Williams seems to stick with one or two 😄.\n\n![The AI-First Musician joins the Table of the Great Composers](https://assets.community.aws/a/2uAWKswk16oKOaPUuBFO0qWhlmu/Fram.webp?imgSize=1000x525 \"The AI-First Musician joins the Table of the Great Composers\")\n\nThis experience shifted my perspective: what initially seemed like a technological novelty revealed itself as a fundamental transformation in how we create, communicate, and solve problems.\n\n## The Epiphany Moment\n\nBy November 2024, I attended AI Supercharge in Wellington where AI adopters showcased how they're implementing GenAI. Three revelations left me astounded. First was the consensus among many attendees that \"AI reduces software development effort by 20 times.\" The second was witnessing Generative AI for software development in action. And third was hearing a marketing graduate's inspiring story of how she secured her dream job.\n\nHave you seen Cursor or Q Developer in action? If not, you should. The ability to interact with source code or a document through conversation is impressive. Even if you see it as an informed guess that sometimes gets things wrong, once you find the right flow, the feedback loop it creates for building something is incredible. Let me share one of my first attempts to capture the wow moments I experienced when discovering Cursor back in 2024.\n\n<Youtube id=\"PZ8fUyogOJU\" />\n\nThe marketing graduate's story was equally compelling: \"I had just graduated with no experience and found a job position I desperately wanted. So what did I do? Working with GenAI, I created a complete marketing campaign proposal and submitted it alongside my resume. I didn't just tell them I could do the job—I showed them.\" After all, if GenAI reduces the effort of generating code or content, why not leverage it for a job application? My thought was \"wow, can you do that?\" Yes, why not?.\n\n# Warning Signs You're Falling Behind\n\nOne of the challenges with this GenAI wave is the overwhelming noise. Headlines scream \"DeepShark launched a new chat and Nvidia stocks fall by 17%\" or \"AI will replace your job\" daily. This constant barrage doesn't help clarify what matters. What truly helps is experimenting yourself and watching for specific signals—indicators that may reveal you're falling behind.\n\nHere are three warning signs that your organization is at risk of AI disruption:\n\n## 1. Your Work is Based on Existing Content and Knowledge\n\nConsider the case of the legal profession, whose work is heavily influenced by a body of knowledge, interpretations, and applications of precedent. This doesn't mean lawyers will disappear—we'll always need legal expertise—but the nature of legal work is transforming rapidly.\n\nThe disruption isn't about elimination but evolution. Entry-level legal positions, where repetitive or non-billable work predominates, are particularly vulnerable. Document review, basic research, and standard contract drafting—traditionally assigned to junior associates—can now be completed by AI systems with increasing accuracy.\n\nThis doesn't mean law students should abandon their studies. Rather, it signals the need for a different approach: rapid technology adoption to learn and apply knowledge faster. Forward-thinking firms like LawCyborg in New Zealand demonstrate how AI integration enables lawyers to focus on higher-value work requiring human judgment, ethical consideration, and client relationship management.\n\nConsider the transformation at Australia's Lawpath: Their AI-powered platform reduced customer service inquiries by 25%, increased document creation by 15%, and cut quote lead times from 3 days to half a day. This efficiency gap puts traditional legal service providers at a significant competitive disadvantage in both response time and service scale. [Learn more](https://aws.amazon.com/solutions/case-studies/lawpath-case-study/)\n\n## 2. Increasing Gap Between Decision Quality and Speed\n\nIf your organization's decision-making process involves extensive human analysis of large datasets while competitors seem to make equally good or better decisions faster, they're likely augmenting human judgment with AI.\n\nA Real-world example: In the financial services and e-commerce sectors, organizations implementing AI fraud detection systems are seeing dramatic improvements in decision quality and speed. For instance, FlightHub Group reduced their transaction abort rate from 5% to under 2% while simultaneously achieving their lowest chargeback rate ever, all without increasing operational costs. Similarly, CDKeys automated over 90% of transactions that previously required manual review, reducing their manual review rate from 10% to less than 1% while cutting fraudulent transactions by 6%. Companies still relying on traditional fraud detection methods are finding themselves at a competitive disadvantage, with slower transaction processing, higher fraud rates, and significantly more resources dedicated to manual reviews. [Learn more about AI-powered fraud detection from AWS](https://aws.amazon.com/ai/use-cases/fraud-detection/)\n\n## 3. The \"Michael Scott Inbox Exercise\"\n\nAre you an AI skeptic? Let me suggest an exercise. Try it yourself. Imagine you're Michael Scott, working for Dunder Mifflin Paper Company, and at the beginning of your day, you need to deal with your email.\n\nIf you open [http://robertoallende.github.io/dundermifflinmail](http://robertoallende.github.io/dundermifflinmail/), you'll open a fake email client with 30 emails. You have to prioritize, filter the important ones, write answers to those that need responses, and compile a list of tasks derived from these messages.\n\n![How long does it take you to process 30 emails](https://assets.community.aws/a/2uJ18sUeYRQ34ARTZVfAxask6c0/Fram.webp?imgSize=1000x525 \"How long does it take you to process 30 emails\")\n\nNo need to do all the tasks I'm suggesting, but take a look at the emails and think how long it would take you.\n\nNow, using Amazon Q Business, that job takes less than one minute. Just watch the video below.\n\n<Youtube id=\"cAzVsYgObzg\" />\n\nIs it perfect? Probably not, although it's quite good. However, given such a high volume of information, it's a great starting point. This isn't a theoretical experiment—it's possible with the tools and models we have right now. The only part missing is the integration.\n\nIf your organization still manages information flow the traditional way while competitors are using AI-powered systems, you're likely spending 5-10x more time on administrative tasks - time that could be redirected to innovation and customer engagement.\n\nBy the way, did you listen to the music in the video? I \"made\" it myself. Isn't it perfect? 😀😀😀.\n\n### Gmail and Outlook Product Owners are Falling Behind\n\nI've seen early versions of similar tools in Gmail and Outlook, but they're not quite there yet. This paragraph will likely be outdated very soon—at least I hope so—but if I were the product owner of these email platforms and not working on comprehensive AI integration, I'd be seriously concerned. They're falling behind.\n\nAll it takes is for products like Superhuman to gain momentum, and suddenly Gmail becomes obsolete. You don't want to wait until that happens to start considering adding AI. By then, it might be too late to catch up, and you'll be facing your own Kodak moment—watching as your market share evaporates because you failed to recognize and adapt to a fundamental shift in how people interact with email.\n\n# The Competitive Advantage Gap is Widening\n\nIf you watch recent Y Combinator Demo Days, you'll notice a surge of startups working with GenAI. It increasingly looks like traditional SaaS will either be replaced by AI-native products or be forced to integrate AI capabilities to remain competitive. Honestly, I can't predict which scenario will prevail, but I'm willing to bet that the tools we use daily will become obsolete, replaced by solutions that truly understand the user.\n\nConsider this: if an AI tool transforms my email into priorities, which then become actions in my todo list, I (almost) don't need email anymore. I might even be able to move beyond the EMAIL protocol entirely. I don't use email because I love its implementation—I use it because it solves problems beyond mere information exchange. If a product can fundamentally address that underlying need, boom. You become the king of email—or whatever they decide to call this new paradigm.\n\nThe competitive advantage isn't just about efficiency - it's about reimagining entire business processes and customer experiences. Companies approaching AI as merely a feature addition rather than a fundamental shift in how they solve problems will find themselves increasingly marginalized.\n\n## Generative AI: Transforming Industries\n\nGenerative AI is creating positive outcomes across numerous industries. Organizations of all sizes are discovering valuable applications that enhance productivity, spark innovation, and solve complex problems. No matter your field, there are practical, beneficial ways to implement this technology.\n\nAWS has documented numerous success stories across sectors:\n\n* **Manufacturing companies** like Holcim reduced manual invoice processing by 90%, while Samsung empowered business analysts to forecast demand without coding experience\n* **Oil & Gas firms** like Bravante RRC developed AI solutions to identify deactivated offshore pipelines requiring removal, reducing planning errors and costly mistakes\n* **Transportation leaders** like KONE use AWS IoT and generative AI to create smarter buildings, accelerating innovation and time to market\n* **Robotics innovators** like KABAM created cloud-based management platforms that enhance robot intelligence with large language model capabilities\n\nExplore these and many more AI transformation stories to discover applications relevant to your industry at [AWS AI Case Studies](https://aws.amazon.com/ai/generative-ai/customers/).\n\n## It May Not Be a Silver Bullet, But Don't Underestimate It\n\nIf you prompt any GenAI to generate a watch showing 3:58 or 6:20 or 3:45, it will likely show 10:09 regardless of what time you request. This happens because most images it was trained on display watches at 10:09—the industry standard for showcasing timepieces in sales materials. Similarly, ask any GenAI to draw a person writing with their left hand, and it invariably depicts the person holding the pen in their right hand, reflecting the right-handed bias in training data.\n\n![A watch displaying the time 3:58 by ChatGPT](https://assets.community.aws/a/2uAYtRrPloZLr31CeDvdd5aX7u2/Fram.webp?imgSize=1000x525 \"A watch displaying the time 3:58 by ChatGPT\")\n\nI've heard many AI skeptics cite examples like these to argue that this isn't a trustworthy technology. That might be fair, and perhaps I'm overly optimistic. But consider this: even if Amazon Q Business's email classification isn't perfect, how long would it take you to read all thirty emails, prioritize them, and identify actions manually? What if you use AI as a first approach, then refine the results? Isn't that still useful and time-saving?\n\nMore critically, what happens if your competitor—whether another business or another person applying for the same job position—is using these tools while you resist them? In a free market economy, those providing better products at better prices usually win. The competitive advantage of AI adoption isn't theoretical—it's measurable in hours saved, opportunities seized, and innovation accelerated.\n\n# Back to the Music: Authenticity vs. Innovation\n\nFor many years, I was captivated by Björk's music. What drew me in was her unique fusion of haunting vocals with electronic beats and classical instruments like cellos and violins. Then, midway through her career, she pivoted—stripping away the electronic elements and orchestral arrangements. That change severed the connection I had with her music.\n\nLast Christmas, I had a revealing conversation with a musician friend who proudly told me he performs only with instruments he can physically play during gigs. \"I want to be authentic,\" he explained, rejecting technological assistance on principle.\n\nHis stance is admirable in its way. But as a music consumer, I realize that when I listen to music, I rarely care about the production methods behind it. What matters is the emotional resonance—the connection I feel.\n\nThis mirrors how we should think about product development and AI. In the same way an artist seeks connection with their audience, solving a real problem effectively matters more than the specific tools used to achieve that solution. Of course, you must ensure you're using compliant and safe technologies—that's non-negotiable. But once those requirements are met, refusing to leverage powerful new tools like generative AI isn't principled; it's self-limiting.\n\n# Is Your Value Proposition at Risk?\n\nDeep down, you likely already know where your organization stands with AI adoption. That gnawing concern when you see competitors launching new capabilities in half the time it would take your team. The slight unease when reading about AI transformations in your industry while your own digital initiatives remain stalled in committees and pilot phases.\n\nThe signs are there if you're willing to see them. Your teams working the same way they did a year ago while the world accelerates around you. Customer expectations shifting faster than your ability to meet them. Competitors seemingly operating on a different timeline altogether.\n\nHere's the thing, I bet you already know the answer or at least you may have the concern. In both cases, the only way forward is to open your mind and learn about it. No checklist or score will tell you what your instincts already know.\n\nThe real question isn't whether you're at risk—in a rapidly transforming landscape, every organization that stands still is. The question is whether you're ready to acknowledge it and take meaningful action before that risk transforms from potential disruption to irreversible decline.\n\n# Your Next Steps\n\n1. **Start experimenting today.** Choose one high-volume, low-risk process in your organization and test how AI could transform it. The email exercise above is a perfect example - implement something similar in your environment.\n2. **Identify your own \"wow\" moment.** As I shared with my music composition experience, the true power of AI often becomes clear through personal experimentation. Encourage key decision-makers to find their own breakthrough use case.\n3. **Map your competitive landscape.** Which of your competitors are already showing signs of AI adoption? What capabilities or efficiencies are they demonstrating that weren't present six months ago?\n\nIn the next post, I'll share my personal definition of what \"AI First\" means, backed by concrete examples of transformative impact when applied to the right use cases.\n\nMany professionals feel like using AI is somehow \"cheating\" – as if the machine is doing their job and they're adding no value. Others remain skeptical, pointing out that AI isn't always right. These are two sides of the same misguided coin.\n\nThink about it: If you ask AI for assistance and it provides the right answer – then what? If you ask AI something and it's wrong – then what? The real transformation lies in how you engage with these outcomes, and that's precisely what I'll explore in upcoming posts.\n\nIn the meantime, don't wait to get started – the gap between AI adopters and laggards is widening every day. The most dangerous position is believing you have time to wait and see. By the time AI's impact becomes obvious in your industry's metrics, the leaders will have already established nearly insurmountable advantages.\n\nWill you be among them, or will you be the next cautionary tale?\n\n***\n\nThank you very much for reading. Please, note that the opinions written in this article are my own and don't necessarily reflect my employer, AWS and any other company mentioned in this post.\n&nbsp;","status":"LIVE","title":"AI First Imperative: Preventing Your Digital Kodak Moment"},{"author":{"alias":"robertoallende","avatarUrl":"https://avatars.builderprofile.aws.dev/2tNTgVpYnfC87APIvSqb7EbIojB.webp","bio":"I design, lead, and deliver systems—technical and human—that turn potential into progress.\nFrom building cloud-native platforms to coaching the previous and next generation on the football field, I thrive at the intersection of engineering and leadership.","creatorId":"e0a0031c-8900-4789-addf-e95154dc95a8","isAmazonEmployee":false,"preferredName":"Roberto Allende"},"commentsCount":0,"contentId":"/content/2tNhySTWG5V6pxxaZi5S7hJcmsy","contentType":"ARTICLE","contentTypeSpecificResponse":{"article":{"description":"Built with Amazon Q Apps in just two hours at the AWS & Ingram Micro GenAI Hackathon in Auckland 2025, Reply.ai is an intelligent email assistant that helps you take control of your inbox.","heroImageUrl":"https://assets.community.aws/a/2tNzlof3pH8RGJcubSg4javslF3/Fram.webp?imgSize=1000x525","tags":["amazonq","amazonqapps","hackathon","genai"],"versionId":"2tY4s3FQV4dp54TX8DOTGW7cy9m"}},"createdAt":1740515876338,"isLiked":false,"lastModifiedAt":1740516117941,"lastPublishedAt":1740208031904,"likesCount":4,"markdownDescription":"## The Problem\n\nI've been there, you've been there: an inbox with millions of mails to prioritize, digest and answer. Actions to identify and plan. Millions, and the days still have 24 hours. Each email represents a task, a decision, or an opportunity, but the sheer volume can be overwhelming. We spend countless hours sorting through messages, trying to determine what's urgent, what can wait, and what actions need to be taken. It's a universal challenge that affects productivity and work-life balance across all industries.\n\n![An inbox with millions of emails](https://assets.community.aws/a/2tNzvpIx9XzNLgPBeBX6r6egpGg/Fram.webp?imgSize=1000x525)\n\nIntroducing Reply.ai, an innovative email management system built on Amazon Q Apps that emerged from the AWS & Ingram Micro GenAI Hackathon in Auckland, New Zealand this February.\n\n## What is Reply.ai?\n\nReply.ai is an intelligent email assistant that leverages Amazon Q's generative AI capabilities to revolutionize how users manage their email workflow. The system analyzes incoming emails, prioritizes them based on user-defined criteria, and generates contextually appropriate responses while tracking actions. What sets Reply.ai apart is its ability to understand user roles and goals, ensuring that email management aligns with broader business objectives.\n\n![ReplyAI](https://assets.community.aws/a/2tSSeD3whfD4Rn4vN51PQY187Ow/Fram.webp?imgSize=1000x525 \"ReplyAI\")\n\n## The Power of Amazon Q Apps\n\nAmazon Q Apps represents a new paradigm in enterprise AI applications. These lightweight, purpose-built applications can be created within the Amazon Q Business environment, allowing organizations to harness generative AI for specific tasks. What makes Q Apps particularly powerful is their accessibility - they can be created by anyone with access to Amazon Q Business, transforming conversations with AI assistants into reusable and shareable applications.\n\n![Amazon Q Apps Creator](https://assets.community.aws/a/2tO0C8JhyFA0reMU9QwDppsfJg4/Fram.webp?imgSize=1000x525)\n\n## How It Works\n\nLet's take for example the inbox of Michael Scott, from Dunder Mifflin Paper Company. As Scranton Regional Manager, his goal is to boost sales but besides mails from corporate, staff looking for advice, loyalty programs and award nominations, Michael needs to focus on his goals.\n\n![Michael Scott's Inbox](https://assets.community.aws/a/2tY51Yd52mpbCPIOrhXodOi1XNG/Fram.webp?imgSize=1000x525 \"Michael Scott's Inbox\")\n\nIn just a few forms, Reply.ai asks for his name, role, and goals and based on that, it generates a list of the mails with priority, answers and actions lists for every mail.&#x20;\n\n![ReplyAI](https://assets.community.aws/a/2tY5F7Z4IZ1QIb3gldnjisDhox8/Fram.webp?imgSize=1000x525 \"ReplyAI\")\n\nThe system understands that while Michael needs to stay on top of corporate communications and team management, emails related to sales opportunities and client relationships should take precedence given his current goals.\n\n![Prioritized Emails](https://assets.community.aws/a/2tO0IjtST0deTEX1X01QfsF328X/Fram.webp?imgSize=1000x525 \"Prioritized Emails\")\n\n![Email Responses](https://assets.community.aws/a/2tO0MKrutckmMuHCHppRc9o2M6O/Fram.webp?imgSize=1000x525 \"Email Responses\")\n\n![Action List](https://assets.community.aws/a/2tO0RDTI6toL3B5AbVmZgkdUJrB/Fram.webp?imgSize=1000x525 \"Action List\")\n\n## Born at the AWS & Ingram Micro GenAI Hackathon\n\nReply.ai was conceived and developed during the AWS & Ingram Micro GenAI Hackathon in Auckland, where developers and business professionals came together to explore the possibilities of generative AI. The project was brought to life by James Green (Business Co-Founder) and Roberto Allende (Technical Co-Founder), who saw the potential to transform email management using Amazon's latest AI technologies.\n\n![Jaime Green and Roberto Allende](https://assets.community.aws/a/2tO0VPe7vlxSmhZaxGXMTi8aUvS/Fram.webp?imgSize=1000x525 \"Jaime Green and Roberto Allende - Creators of Reply.ai\")\n\n## Future Enhancements\n\nWhile the current version of Reply.ai offers powerful email management capabilities, the team has exciting plans for future enhancements:\n\n* Implementation of automated email polling through Actions\n* Development of  email delivery mechanisms\n* Integration with project management systems for seamless task tracking\n* Enhanced plugins for automated workflow triggers\n\n## Open Source Resources\n\nThe complete source code for Reply.ai is available on [reply.ai's GitHub Repository](https://github.com/robertoallende/reply.ai). The repository includes:\n\n* Detailed prompt instructions for configuring the Q App\n* Architecture diagrams for both current (v1.0) and future (v2.0) versions\n* Complete documentation for deployment and testing\n* Sample configurations for different use cases\n\nThese resources make it easy for developers to understand the implementation details and deploy their own instance of Reply.ai.\n\n## Hackathon Victory\n\nThe innovative approach to email management and the rapid development of a production-ready solution earned Reply.ai the first place in the two-hour AWS & Ingram Micro GenAI Hackathon.\n\n![Hackathon Winner](https://assets.community.aws/a/2tO0fHcFRjXyoQAac3vHizQ5tZa/Fram.webp?imgSize=1000x525 \"Hackathon Winner\")\n\n## A Word of Thanks\n\nThe development of Reply.ai wouldn't have been possible without the support and guidance of the AWS & Ingram Micro GenAI Hackathon organizers. Special thanks go to Andrei Lizarraga and Vivian Weiwei Luo, whose expertise and dedication helped shape this project and many others during the event.\n\n***\n\nReply.ai represents just the beginning of what's possible with Amazon Q Apps and generative AI in the enterprise space. As we continue to develop and enhance the platform, we're excited to see how it will transform email management for organizations worldwide.\n\nFor more information about Reply.ai or to get started with the platform, look for the [GitHub repository](https://github.com/robertoallende/reply.ai),  where you can find detailed documentation and deployment instructions.\n&nbsp;","status":"LIVE","title":"Free Up Your Time from Email with Amazon Q Apps & GenAI"}]}