{
    "version": "https://jsonfeed.org/version/1",
    "title": "Football Notes",
    "description": "",
    "home_page_url": "https://en.allende.nz/football",
    "feed_url": "https://en.allende.nz/football/feed.json",
    "user_comment": "",
    "author": {
        "name": "Roberto Allende"
    },
    "items": [
        {
            "id": "https://en.allende.nz/football/bielsa-dont-let-failure-lower-your-self-esteem/",
            "url": "https://en.allende.nz/football/bielsa-dont-let-failure-lower-your-self-esteem/",
            "title": "Bielsa: &quot;Don&#x27;t Let Failure Lower Your Self-Esteem&quot;",
            "summary": "The following is a translation of the article published in Marca.com in May 2012. Photo by Bruce Rollinson, taken after Leeds United’s loss at Queens Park Rangers on 26 February 2019. The Athletic coach made it clear years ago in a talk with young people&hellip;",
            "content_html": "<p>The following is a translation of <a href=\"https://www.marca.com/2012/05/11/futbol/equipos/athletic/1336734817.html\">the article published in Marca.com in May 2012</a>.<br>Photo by Bruce Rollinson, taken after Leeds United’s loss at Queens Park Rangers on 26 February 2019.</p>\n<p>The Athletic coach made it clear years ago in a talk with young people how he lives football. He revealed that success had made him worse and that defeat helped him grow. Now he will try to instill this in his players.</p>\n<p><strong>VERÓNICA BRUNATI. BUENOS AIRES 11/05/2012 - 13:13.</strong></p>\n<p>Marcelo Bielsa is a man of stern demeanor, who rarely shows his emotions in public. But in private, he often does. He even opens up to express his deepest feelings.</p>\n<p>When he was the Argentine national team coach, he gave a talk to boys aged 13 to 17 at the Sagrado Corazón school in Rosario, where he attended high school. The condition was that there would be no press. And although that meeting was kept secret that day, his words later came to light, gaining greater significance over time.</p>\n<p>In this speech, Bielsa reveals the value he places on both success and failure. His reflections paint a full picture of him and reflect his deepest thoughts, especially in moments of frustration like the present. Here are some examples of his reflections: \"The moments in my life when I have grown are related to failures; the moments in my life when I have worsened are related to success.\"</p>\n<p>He explains: \"Success is deforming, it relaxes, deceives, makes us worse, and helps us fall excessively in love with ourselves; failure is the opposite, it is formative, it makes us solid, brings us closer to our convictions, and makes us coherent. While we compete to win, and I work in what I work because I want to win when I compete, if I didn't distinguish what is truly formative and what is secondary, I would be making a mistake.\"</p>\n<p>The coach continues with his unique perspective on the impact football has on society: \"I am absolutely convinced that fame and money are insignificant values. I am sure of one thing: I was happy when I enjoyed amateurism, I was happy when I grew up in love with my work. I have a deep love for football, for the game, for the street corner, for the vacant lot, for the pickup game, for the ball. And I despise everything added. To explain this a little better, I know that the joy of a victory in a match lasts five minutes, then there is a huge and immense emptiness. And an indescribable loneliness.\"</p>\n<p>The coach has no doubts: \"I want to insist that it is much better to be prestigious than popular. I never let myself be tempted by praise. Praise in football is absolutely hypocritical. Football is conceived that way, there has to be either great joy or great sadness. Defeat or victory, blood or applause, are values very dear to humans,\" he says.</p>\n<p>Bielsa is clear: \"In failure, I suffer a lot from the injustice of the treatment, I never managed to master that. I always suffer a lot when we lose and when I am mistreated, but I did manage not to believe in the duration of success. Since no one reviews why you won, it doesn't matter, they flatter you for having won and not because you deserved to win.\"</p>\n<p>And this analysis fits his team perfectly: \"Do not let failure damage your self-esteem. When you win, the message of admiration is so confusing, it stimulates self-love so much, and it distorts so much. And when you lose, the opposite happens. There is a morbid tendency to discredit you, to offend you, just because you lost. In any task, you can win or lose, the important thing is the nobility of the resources used.\"</p>",
            "image": "https://en.allende.nz/football/media/posts/7/legacy_ash_106627663.jpg",
            "author": {
                "name": "Roberto Allende"
            },
            "tags": [
                   "Victory",
                   "Values",
                   "Defeat",
                   "Bielsa"
            ],
            "date_published": "2024-06-16T10:39:59+12:00",
            "date_modified": "2024-06-16T10:43:41+12:00"
        },
        {
            "id": "https://en.allende.nz/football/overcoming-adversity-in-football/",
            "url": "https://en.allende.nz/football/overcoming-adversity-in-football/",
            "title": "Adversity in Football and in Life",
            "summary": "<p>When I was 10 years old, I wanted to play football and I joined a club. My friends suggested I should be a goalkeeper because they thought I had the skills and the team only had one who apparently did not stand out. However, in the first practice, I chose to play as a defender, which led to a resounding \"No!\" from my friends. I wanted to be number two, a position already held by the team's captain, an irreplaceable player.</p>\n",
            "content_html": "<p>When I was 10 years old, I wanted to play football and I joined a club. My friends suggested I should be a goalkeeper because they thought I had the skills and the team only had one who apparently did not stand out. However, in the first practice, I chose to play as a defender, which led to a resounding \"No!\" from my friends. I wanted to be number two, a position already held by the team's captain, an irreplaceable player.</p>\n\n<p>Over the weeks, the coach would tell me every Thursday, \"Kid, don't come on Saturday, you're not going to play.\" Eventually, my mother decided to take me out of the team and I never returned to club play.</p>\n<div class=\"markdown prose w-full break-words dark:prose-invert dark\">\n<p>The curious thing about this episode is that I don't remember it as a frustrating one<span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">. Perhaps I was frustrated at the time, even when my parents told me they would no longer take me to the club, but the prevailing memory is that I still wanted to keep playing and attending training. I really believe I enjoyed it.</span></p>\n<p>From that group, one player made it to the professional level and joined the first team of a major club in my city that plays in the top division of Argentine football. He made it, but he never left the bench and spent his best years hoping to start. The years passed and his career did not progress until he had to retire.</p>\n<h2>There are things that are not under your control.</h2>\n<p>It's complicated because in football, you always depend on someone else's decision. It doesn’t matter what role you have: the player depends on the coach, the coach on the club's authorities, the club on the league, the league on the federation, the federation on FIFA, and as for FIFA... who knows? I cannot even imagine how challenging it must be to govern such an organization.</p>\n<p>A football federation was a client of the organization where I held one of my first jobs as a software engineer. During the project, an executive explained to me very clearly that in a football match, <strong>two games are played: the one played by the players on the field and the one played by the politicians off it</strong>. This isn’t necessarily corruption; often, playing in one stadium is more favorable than another for a team. A disciplinary measure can be less or more severe; the executives can appeal. There is a game beyond the one played on the field. At worst, it's a political game. At best, it's a decision game.</p>\n<p>It's complicated, very complicated. But if there is one very clear thing, it's that no matter what position or role you have, there are always things out of your control. Thus, if today you find yourself on the bench or the game frustrates your expectations, the best thing you can do is learn to face that frustration. Frustration is part of the game, just as winning and losing is.</p>\n<p>Before confronting it, I believe it is natural to let the bitter taste flow. You need to give yourself time to recognize that things didn’t go as expected. The key is not to dwell there but to move forward.</p>\n<p>In this process, the concept of \"circles of influence\" and \"circles of control\" described by Stephen R. Covey in the book \"<a href=\"https://en.wikipedia.org/wiki/The_7_Habits_of_Highly_Effective_People\" target=\"_blank\" rel=\"noopener noreferrer\">The 7 Habits of Highly Effective People</a>\" is enlightening. These circles are part of a broader framework Covey uses to help people manage their effectiveness by focusing on the aspects of their lives they can influence or control.</p>\n<p> </p>\n<figure class=\"post__image\" ><a href=\"https://learningloop.io/glossary/circles-of-influence\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" src=\"https://en.allende.nz/football/media/posts/6/circles-of-influence.jpg\" alt=\"Circles of Influence\" width=\"1468\" height=\"994\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/6/responsive/circles-of-influence-xs.jpg 300w ,https://en.allende.nz/football/media/posts/6/responsive/circles-of-influence-sm.jpg 480w ,https://en.allende.nz/football/media/posts/6/responsive/circles-of-influence-md.jpg 768w ,https://en.allende.nz/football/media/posts/6/responsive/circles-of-influence-lg.jpg 1024w ,https://en.allende.nz/football/media/posts/6/responsive/circles-of-influence-xl.jpg 1360w ,https://en.allende.nz/football/media/posts/6/responsive/circles-of-influence-2xl.jpg 1600w\"></a>\n<figcaption >Circles of Influence is a concept that helps individuals focus on the things they can control or influence, and accept the things they cannot</figcaption>\n</figure>\n<p>Here is a brief description:</p>\n<h3>Circle of Control</h3>\n<p>Includes things over which you have direct control, such as your behavior, decisions, and actions. Focusing on this circle empowers you because it focuses on your personal responsibility and your ability to initiate change.</p>\n<h3>Circle of Influence</h3>\n<p>This circle encompasses areas where you can affect outcomes but do not have total control. This might include relationships, workplace dynamics, or broader social interactions. You can exert influence through persuasion, example, and negotiation.</p>\n<h3>Circle of Concern</h3>\n<p>Includes a broader range of issues, such as global economic conditions, natural disasters, or the behavior of others, over which you have little or no direct control. While these issues may concern you, focusing too much on them can lead to feelings of helplessness and stress because your capacity to effect change is limited.</p>\n<blockquote>\n<p>There lies the key to moving forward and not remaining indefinitely frustrated: recognizing what's under your control and focusing all energy and effort on it.</p>\n</blockquote>\n<h2>Dibu, Mascherano and Messi</h2>\n<p>Allow me to illustrate these ideas with three examples.</p>\n<p><strong>Emiliano Martínez</strong>, also known as Dibu, began his career at Independiente in Argentina and was transferred to Arsenal in 2010. For several years, he remained on the bench or was loaned out to other teams, facing intense competition for a starting position in the main team.</p>\n<p>Over a decade at Arsenal, Martínez tirelessly fought to secure a place, being loaned out repeatedly to gain experience. It wasn't until he was 27 years old that he finally established himself as a starter, taking advantage of another goalkeeper's injury.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://en.allende.nz/football/media/posts/6/DibuMartinez.jpeg\" alt=\"Emiliano Martinez\" width=\"1920\" height=\"1080\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/6/responsive/DibuMartinez-xs.jpeg 300w ,https://en.allende.nz/football/media/posts/6/responsive/DibuMartinez-sm.jpeg 480w ,https://en.allende.nz/football/media/posts/6/responsive/DibuMartinez-md.jpeg 768w ,https://en.allende.nz/football/media/posts/6/responsive/DibuMartinez-lg.jpeg 1024w ,https://en.allende.nz/football/media/posts/6/responsive/DibuMartinez-xl.jpeg 1360w ,https://en.allende.nz/football/media/posts/6/responsive/DibuMartinez-2xl.jpeg 1600w\">\n<figcaption >It wasn't until he was 27 years old that Emiliano Martinez finally established himself as a starter</figcaption>\n</figure>\n<p>At 28, Martínez won his first major title, the FA Cup with Arsenal. This victory marked the beginning of his recognition in elite football, and he subsequently established himself at Aston Villa and stood out in the Argentine national team, significantly contributing in major international tournaments such as the Copa América and the World Cup.</p>\n<p>Another example is <strong>Javier Mascherano</strong>, who joined FC Barcelona in 2010 from Liverpool, with a solid record as a defensive midfielder. In Barcelona, he faced fierce competition in midfield from figures like Sergio Busquets and Xavi Hernández. Faced with this situation, Mascherano adapted to playing as a central defender, a role that was not initially his specialty. This transition proved successful; under the guidance of coaches like Pep Guardiola and Luis Enrique, Mascherano secured his place in the defense, contributing to the team's success in competitions such as the Champions League and the League, proving to be a versatile and indispensable player.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/6/JavierMascherano.jpg\" alt=\"\" width=\"1200\" height=\"800\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/6/responsive/JavierMascherano-xs.jpg 300w ,https://en.allende.nz/football/media/posts/6/responsive/JavierMascherano-sm.jpg 480w ,https://en.allende.nz/football/media/posts/6/responsive/JavierMascherano-md.jpg 768w ,https://en.allende.nz/football/media/posts/6/responsive/JavierMascherano-lg.jpg 1024w ,https://en.allende.nz/football/media/posts/6/responsive/JavierMascherano-xl.jpg 1360w ,https://en.allende.nz/football/media/posts/6/responsive/JavierMascherano-2xl.jpg 1600w\"><figcaption>From Liverpool to Barcelona: Mascherano had to adapt to a new position upon his arrival.</figcaption></figure>\n<p>Starting a competitive career at 28 may seem late, especially for a goalkeeper. However, the key is that Martínez did not start at 28. He trained and prepared for many years to seize his opportunity when the starting goalkeeper was injured and he was ready.</p>\n<p>After his stint at Liverpool, Mascherano could have believed he was a star and that the team should adapt to him. Had he followed that path, he likely would have ended up on the bench. Instead, he adjusted his expectations, adapted, and learned what was necessary, ultimately playing and winning tournament finals with the Champions League, not to mention his 414 matches alongside Lionel Messi.</p>\n<p>In the face of adversity, it is best to initially allow oneself to feel the frustration. However, it is crucial not to remain stuck in it and to move forward. Moving forward is a mental game, and the key is to recognize what is under our control. In adverse outcomes, there are always opportunities: opportunities to learn, adapt to new circumstances, and explore new positions.</p>\n<p>I am convinced that these may seem like mere nice words, but if you look at the careers of those who have excelled, you will see that they stood out because they managed to overcome adversities.</p>\n<p>This process is what made them great. Nobody is born winning.</p>\n<p>And there's no better example of this than <strong>Lionel Messi</strong>. Starting with his medical condition at an early age, the economic struggles that forced him to split his family as a child to move to Europe. As an adult, even though he was recognized as one of the best footballers in history, it took him participation in four World Cups before he finally won it at his fifth attempt in 2022, nearly at the end of his career.</p>\n<a href=\"https://www.youtube.com/watch?v=FgZZ32fCanc\" target=\"_blank\" rel=\"noopener noreferrer\">\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/6/Screenshot-2024-04-14-at-17.55.51.png\" alt=\"Messi's story by Gatorade\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.55.51-xs.png 300w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.55.51-sm.png 480w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.55.51-md.png 768w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.55.51-lg.png 1024w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.55.51-xl.png 1360w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.55.51-2xl.png 1600w\"><figcaption>Messi's life, much like a fairy tale, is not without its setbacks.</figcaption></figure>\n</a>\n<p>This idea transcends sports. <a href=\"https://en.wikipedia.org/wiki/Jensen_Huang\">Jensen Huang</a> recently said, </p>\n<blockquote>\n<p>Greatness does not come from intelligence. Greatness comes from character, and character isn't formed out of smart people; it's formed out of people who have suffered.</p>\n</blockquote>\n<a href=\"https://twitter.com/BUILD_OR_DIE/status/1773570462016020960\" target=\"_blank\" rel=\"noopener noreferrer\">\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/6/Screenshot-2024-04-14-at-17.47.32.png\" alt=\"Jensen Huang: Greatness comes from character.\" width=\"1208\" height=\"680\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.47.32-xs.png 300w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.47.32-sm.png 480w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.47.32-md.png 768w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.47.32-lg.png 1024w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.47.32-xl.png 1360w ,https://en.allende.nz/football/media/posts/6/responsive/Screenshot-2024-04-14-at-17.47.32-2xl.png 1600w\"><figcaption>Jensen Huang: Greatness comes from character.</figcaption></figure>\n</a>\n<p>You weren't picked for the team you wanted. <br>You're not playing the minutes you expected. <br>You couldn't get the job you applied for.</p>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Don't let the problem define who you are, <br>but rather how you come back.</span></p>\n</div>",
            "image": "https://en.allende.nz/football/media/posts/6/DALLE-2024-04-14-14.21.22-A-linear-photo-collage-of-a-soccer-player-on-the-field-featuring-four-images-side-by-side.-The-first-three-images-are-in-black-and-white-showing-the.webp",
            "author": {
                "name": "Roberto Allende"
            },
            "tags": [
                   "Success",
                   "Lineup",
                   "Junior Path",
                   "Expectations"
            ],
            "date_published": "2024-04-14T17:33:54+12:00",
            "date_modified": "2024-04-14T19:11:57+12:00"
        },
        {
            "id": "https://en.allende.nz/football/beyond-the-joystick-empowering-players-autonomy-and-creativity-in-football/",
            "url": "https://en.allende.nz/football/beyond-the-joystick-empowering-players-autonomy-and-creativity-in-football/",
            "title": "Beyond the Joystick. Empowering Players&#x27; Autonomy and Creativity in Football",
            "summary": "<p>How can we prevent all players from crowding around the ball like a swarm of bees? That was one of the first questions I asked myself when I started coaching kids.</p>\n<p>I don’t know if there’s a perfect solution, and I’m still searching for an answer to that question. I keep searching because, in reality, this is part of a broader problem that doesn’t only apply to kids. It’s about influencing the behavior of a group or even shaping habits.</p>\n<p>Here are two different alternatives to solve this problem.</p>\n",
            "content_html": "<p>How can we prevent all players from crowding around the ball like a swarm of bees? That was one of the first questions I asked myself when I started coaching kids.</p>\n<p>I don’t know if there’s a perfect solution, and I’m still searching for an answer to that question. I keep searching because, in reality, this is part of a broader problem that doesn’t only apply to kids. It’s about influencing the behavior of a group or even shaping habits.</p>\n<p>Here are two different alternatives to solve this problem.</p>\n\n<h1 id=\"the-joystick-coach\">The Joystick Coach<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h1>\n<p>The first way to solve the problem is by giving instructions to the players. Shouting at them loudly to make sure they hear us. We can give them all kinds of instructions like “run,” “pay attention,” “go,” “come back,” “kick the ball with your right foot,” “use your left foot,” “head it,” “jump,” etc.</p>\n<p>I once watched a game where the coach was directing his team in this way. To be honest, it was irritating and deafening. The worst part was when his team got a corner kick, a player grabbed the ball, turned around, and shouted at the coach, “What do I do?” The player needed the coach to tell him what to do during a corner kick. It’s true that you can have planned plays or follow certain guidelines, but a corner kick in children’s football should be simple: send the ball into the area or make a pass. There’s not much more to it. The player couldn’t decide that on his own.</p>\n<blockquote>\n<p>The problem with those who dictate tactics is that they take away the joy and creativity from the players. The most important thing in football is to play with joy and passion. If you’re not enjoying it, you’re not playing the game correctly. Brian Clough</p>\n</blockquote>\n<p>The problem with the joystick coach is that it takes away the players’ sense of autonomy.</p>\n<p>Autonomy and intrinsic motivation are closely related and often go hand in hand. Autonomy refers to the sense of self-direction and control that individuals have over their actions and decisions. On the other hand, intrinsic motivation refers to engaging in an activity for its own enjoyment and satisfaction, rather than for external rewards or pressures.</p>\n<p>When people have a sense of autonomy, they feel empowered and have the freedom to make decisions and choices that align with their own interests, values, and goals. This autonomy supports and enhances intrinsic motivation. When people have autonomy to engage in activities they find meaningful and enjoyable, they can nurture their intrinsic motivation to participate in those activities voluntarily and wholeheartedly.</p>\n<p>In contrast, when people experience a lack of autonomy, such as being excessively controlled or micromanaged, it can hinder their intrinsic motivation. External pressures, strict rules, or imposed goals can diminish the sense of autonomy and reduce intrinsic motivation, making the activity feel more like an obligation than a personally fulfilling pursuit.</p>\n<p>Research has consistently shown that providing autonomy to individuals in their work, learning, or other areas of life can promote intrinsic motivation, leading to increased engagement, creativity, and overall well-being. By allowing individuals to have a say in their actions and fostering a sense of self-determination, autonomy supports and nurtures their intrinsic motivation to engage in activities for the pure joy, curiosity, or personal growth they bring.</p>\n<p>This is closely aligned with what the current coach of Brighton &amp; Hove Albion says:</p>\n<blockquote>\n<p>I don’t move my players with a joystick… the decisions are all up to them. Roberto de Zerbi</p>\n</blockquote>\n<h1 id=\"games-with-incentives-and-restrictions\">Games with Incentives and Restrictions<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h1>\n<p>Let’s say we want to teach a group of kids how to make passes. A joystick coach shouts at the players to pass the ball until they understand it.</p>\n<p>This not only frustrates everyone but also takes a long time to work. One of the reasons it doesn’t work is that players, especially children, may take a long time to understand what making a pass means.</p>\n<p>Making a pass is difficult to learn because it requires many skills that are not easy to incorporate. For example, looking up, having a spatial awareness of teammates, having the motor skills to kick the ball with the right force and direction, etc.</p>\n<p>The idea to solve this problem is to devise specific games to acquire skills or change habits. For example, in the case of passing, the “rondo” is a simple game with restricted rules designed specifically for players to practice specific passing skills, among others.</p>\n<p>A rondo is a game where a group of players positions themselves in a small space, forming a circle, while one or several players defend in the center. The goal of the players in the circle is to maintain ball possession through quick and accurate passes, while the defenders try to intercept the ball.</p>\n<p>Another example would be dividing the playing field into different lanes and assigning one to each player to teach them to avoid crowding. Then, restrictions and incentives can be set. For instance, if a player stays in their lane, they have no restrictions, but if they step out of it, they can only touch the ball once. Violating this restriction results in the opposing team being awarded a free kick.</p>\n<p>That’s why training sessions are important. It’s the moment to make interventions. The rondo is just one example, and there are as many playful interventions as there are skills to develop or train. The key is to recognize the behavior or habits you want to incorporate and then find or develop the necessary game.</p>\n<p>Restrictions can be incorporated into matches, but in practice, I haven’t found it necessary. It’s impressive to see how in a matter of weeks, a swarm of bees can disperse on a football field and start using space intelligently.</p>\n<blockquote>\n<p>For many, football is played with the feet. For me, it is played with the head, and the feet are used to express it. Johan Cruyff</p>\n</blockquote>\n<p>Football is played with the head because it’s a game of decision-making. Forcing individual or collective decisions comes at a high cost: it discourages players’ autonomy and motivation. The best alternative I’ve found so far to convey a concept is to present different options through activities to the players during training and let them decide in the match.</p>\n<p>The key is to respect the players’ decisions, especially during the match, to the point where I’ve come to believe that telling a player what to do in a match is like spoiling the ending of a movie.</p>\n<p>And no one wants to be a spoiler.</p>",
            "image": "https://en.allende.nz/football/media/posts/5/joystickCoach.webp",
            "author": {
                "name": "Roberto Allende"
            },
            "tags": [
                   "Passes",
                   "Joystick",
                   "Autonomy"
            ],
            "date_published": "2023-06-04T17:00:00+12:00",
            "date_modified": "2024-04-15T11:58:49+12:00"
        },
        {
            "id": "https://en.allende.nz/football/fast-play-fast/",
            "url": "https://en.allende.nz/football/fast-play-fast/",
            "title": "Fast! Play fast",
            "summary": "Playing slowly allows your opponent to get organized, which often leads to turnovers and ultimately, losses. Avoiding slow play is crucial for winning games. So, what does it mean to play fast? Watch the following video to see fast football in action: Playing fast in&hellip;",
            "content_html": "<p>Playing slowly allows your opponent to get organized, which often leads to turnovers and ultimately, losses. Avoiding slow play is crucial for winning games. So, what does it mean to play fast?</p>\n<hr>\n<p>Watch the following video to see fast football in action:</p>\n<figure class=\"post__image\"><a href=\"https://www.youtube.com/watch?v=RWgJ4KKn1vM\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/4/Screenshot-2024-04-14-at-16.01.38.png\" alt=\"\" width=\"1602\" height=\"914\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.01.38-xs.png 300w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.01.38-sm.png 480w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.01.38-md.png 768w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.01.38-lg.png 1024w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.01.38-xl.png 1360w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.01.38-2xl.png 1600w\"></figure></a></p>\n<p>Playing fast in football does not necessarily require long balls. Rather, it means moving the ball quickly. Nothing in football is faster than a moving ball - even the fastest player on the field cannot cover fifty meters as fast as a kicked ball. In Messi’s goal, it takes only five seconds for the ball to travel from midfield to the net.</p>\n<p>Another beautiful goal</p>\n<figure class=\"post__image\"><a href=\"https://www.youtube.com/watch?v=mMiL4_1Yewg\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/4/Screenshot-2024-04-14-at-16.06.24.png\" alt=\"\" width=\"1702\" height=\"960\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.06.24-xs.png 300w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.06.24-sm.png 480w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.06.24-md.png 768w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.06.24-lg.png 1024w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.06.24-xl.png 1360w ,https://en.allende.nz/football/media/posts/4/responsive/Screenshot-2024-04-14-at-16.06.24-2xl.png 1600w\"></figure></a></p>\n<p>Messi’s incredible dribbling skills are also a great example of playing fast, but it took 19-year-old Messi up to ten seconds to carry the ball from midfield to the net in his goal. While it’s impressive, not everyone can dribble past half of the opposing team in just ten seconds and score a goal.</p>\n<p>So, fast football doesn’t necessarily require long balls or superhuman dribbling speed. Simple touches can achieve the same outcome. One or two-touch football can result in a goal in less than ten seconds, without the big error margin that comes with dribbling or long balls. Check out the following example.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/gm3jomzFEpk?t=31s\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h1 id=\"play-fast-not-in-a-hurry\">Play fast, not in a hurry<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h1>\n<p>Check out this video where a team plays fast, not in a hurry. They move the ball with patience, looking for the gap in the defense.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/iBZdcpdxoTA\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Playing fast typically means playing at a high tempo or pace, where the player is focused on moving quickly and efficiently without sacrificing control or accuracy.</p>\n<p>On the other hand, playing in a hurry typically implies a sense of panic or urgency, where the player is rushing their decisions or movements without proper control or strategy.</p>\n<h1 id=\"totally-possible\">Totally Possible<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h1>\n<p>This is totally possible in Amateur and Junior Football. Watch the following goals.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/wlb2h_cyhQ8\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>It takes about five seconds from midfield to the end of the net. These players are eight years old.</p>\n<p>Another one. Different team. Same coach.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/Yw1qA9vl7Uo\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>These players are 11 years old.</p>\n<p>Same team, two years before.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/juQ7XE0Qp9g\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h1 id=\"how-to-play-fast-and-win-games\">How to Play Fast and Win Games<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h1>\n<p>To play fast, you must have the desire to do so. It’s a decision that needs to be made before the game starts. You need to consciously choose to play at a high tempo, limiting your touches on the ball to maintain quick play. Dribbling is a great resource, but it should be the exception, not the rule. If you want to play fast and get the job done, use one touch instead of two. If you can accomplish it in two touches, avoid taking three. The more touches you need to control and pass the ball, the slower your progress will be.</p>\n<p>Another way to think about speed in football is through what <a href=\"https://www.amazon.com/Soccer-IQ-Things-Smart-Players/dp/1469982471\">Dan Blank</a> calls the <em>football speed ladder</em>:</p>\n<ul>\n<li>The <strong>slowest</strong> way to move the ball in football is when a player dribbles while making lateral movements and feints.</li>\n<li><strong>Slow</strong> play is when a player runs straight ahead with the ball at top speed.</li>\n<li><strong>Faster</strong> is a player running without the ball.</li>\n<li>The <strong>fastest</strong> football is a moving ball.</li>\n</ul>\n<p>Speed of play is more than a habit - it’s a lifestyle. You can only fully embrace it when you realize that nothing is more important than quick play. In football, fast is better than slow, and it’s ultimately what wins games.</p>",
            "image": "https://en.allende.nz/football/media/posts/4/the-flash-playing-football.jpg",
            "author": {
                "name": "Roberto Allende"
            },
            "tags": [
                   "Speed",
                   "Passes"
            ],
            "date_published": "2023-03-30T16:00:00+13:00",
            "date_modified": "2024-04-14T19:02:48+12:00"
        },
        {
            "id": "https://en.allende.nz/football/introducing-astuten/",
            "url": "https://en.allende.nz/football/introducing-astuten/",
            "title": "Introducing Astuten",
            "summary": "As a grassroots football coach I want to make sure I give fair playing time to every player on my team. That’s why I used to spend hours planning game subs. Planning subs is not easy because it’s not just about playing time. You also&hellip;",
            "content_html": "<p>As a grassroots football coach I want to make sure I give fair playing time to every player on my team. That’s why I used to spend hours planning game subs.</p>\n<hr>\n<p>Planning subs is not easy because it’s not just about playing time. You also want to rotate positions but not that often. You want to optimise learning opportunities given the difficulty an opponents provides and so on.</p>\n<p>More than once occasion, I showed up to a match with perfect plan just to get a phone call from a parent telling me that his child couldn’t play that day and now I had came up with new plan in just few minutes.</p>\n<p>Every time I made a plan or I had to make a last minute adjustment I thought the must be a better way to do this.</p>\n<p>And that’s why I developed <a href=\"http://astuten.io/\">Astuten</a>.</p>\n<p>Astuten has three simple goals:</p>\n<ul>\n<li>Allow coaches to make player substitution plans in seconds.</li>\n<li>Manage and follow lineups in real-time during matches.</li>\n<li>All in one app and across all your web browsers and devices.</li>\n</ul>\n<p>Are you curious? watch the demo video below and <a href=\"https://www.astuten.com/\" title=\"Download Astuten\">download the app</a> to try it yourself.</p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ayRMwlBseJg?si=YamC5-GTqLz-mxzE\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"allowfullscreen\"></iframe></div>\n<p>Astuten is a live project so, if you find a feature that the app must have, don’t hesitate to write me. I want to make Astuten as much as useful for you as it’s for myself.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/3/Screenshot-2024-04-14-at-15.54.26.png\" alt=\"\" width=\"1368\" height=\"178\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/3/responsive/Screenshot-2024-04-14-at-15.54.26-xs.png 300w ,https://en.allende.nz/football/media/posts/3/responsive/Screenshot-2024-04-14-at-15.54.26-sm.png 480w ,https://en.allende.nz/football/media/posts/3/responsive/Screenshot-2024-04-14-at-15.54.26-md.png 768w ,https://en.allende.nz/football/media/posts/3/responsive/Screenshot-2024-04-14-at-15.54.26-lg.png 1024w ,https://en.allende.nz/football/media/posts/3/responsive/Screenshot-2024-04-14-at-15.54.26-xl.png 1360w ,https://en.allende.nz/football/media/posts/3/responsive/Screenshot-2024-04-14-at-15.54.26-2xl.png 1600w\"></figure>",
            "image": "https://en.allende.nz/football/media/posts/3/astuten-concept.jpg",
            "author": {
                "name": "Roberto Allende"
            },
            "tags": [
                   "MobileApp",
                   "Lineup",
                   "Coach",
                   "Astuten"
            ],
            "date_published": "2022-07-08T15:00:00+12:00",
            "date_modified": "2024-04-14T15:58:26+12:00"
        },
        {
            "id": "https://en.allende.nz/football/expectations-for-a-junior-football-journey/",
            "url": "https://en.allende.nz/football/expectations-for-a-junior-football-journey/",
            "title": "Expectations for a Junior Football Journey",
            "summary": "<p>A child dribbles the ball and breaks the opponent’s defence and now he/she is in front of the goalkeeper and has to resolve the situation in a few milliseconds.</p>\n<p>The player misses. Is it bad?. The player scores. Is it good?.</p>\n<p>There are countless situations like this in a game like a football. Situations that not only belong to the game itself but also about the relationship with teammates, adversity, and authority, just to mention a few.</p>\n",
            "content_html": "<p>A child dribbles the ball and breaks the opponent’s defence and now he/she is in front of the goalkeeper and has to resolve the situation in a few milliseconds.</p>\n<p>The player misses. Is it bad?. The player scores. Is it good?.</p>\n<p>There are countless situations like this in a game like a football. Situations that not only belong to the game itself but also about the relationship with teammates, adversity, and authority, just to mention a few.</p>\n\n<p>From the sideline, adults watch and guide the children playing the game and after every situation, we may wonder what is the role of the adult after the match for each case? Should the adult intervene or not? For example, should we point out what is the right way to solve the problem? Should we keep silent and let the child figure it out on his/her own? Should we think nothing of the issue because is just a game?</p>\n<p>In <em><a href=\"https://www.youtube.com/watch?v=cPrdgWwbGMQ\">Conversations about the Future</a>,</em> Pep Guardiola says:</p>\n<blockquote>\n<p>Sports were the most useful learning tool that I had as a child. Through Sports, I learned to accept defeat, I learned there are others better than myself, I learned to come back after defeats, and I learned that coach may say that today I won’t play because I had bad behavior. I learned all the basic dynamics of human relationships. But I’ve not learned these by imposition but by observing, experimenting, or sharing situations. That’s why I think that group sports have more potential than individual sports. In group sports I’ve to interact with people.</p>\n<p>Through sports, I learned that today I’ve to make an effort for you and I know that tomorrow you’ll make an effort for me because we want to achieve a common goal.</p>\n</blockquote>\n<p>Football is just a game, but based on Pep’s experience and a few research publications, it’s also a <em>learning opportunity</em>.</p>\n<p>If we assume learning is an important criterion in junior coaching we may wonder if it is the only one or if we think in general terms, what is success.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/2/guardiola-trueba.jpg\" alt=\"Sports were the most useful learning tool that I had as a child says Guardiola in Conversations about the Future\" width=\"2872\" height=\"1620\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/2/responsive/guardiola-trueba-xs.jpg 300w ,https://en.allende.nz/football/media/posts/2/responsive/guardiola-trueba-sm.jpg 480w ,https://en.allende.nz/football/media/posts/2/responsive/guardiola-trueba-md.jpg 768w ,https://en.allende.nz/football/media/posts/2/responsive/guardiola-trueba-lg.jpg 1024w ,https://en.allende.nz/football/media/posts/2/responsive/guardiola-trueba-xl.jpg 1360w ,https://en.allende.nz/football/media/posts/2/responsive/guardiola-trueba-2xl.jpg 1600w\"><figcaption><em>Sports were the most useful learning tool that I had as a child says Guardiola in Conversations about the Future</em></figcaption></figure>\n<h2 id=\"success\">Success<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h2>\n<p>One of the best ways I found to define what is success in junior sports is the one written by Denis Ford in <em>Coaching junior Soccer</em>. Ford defines a process as successful when the child returns the following year to keep playing.</p>\n<p>This is a recursive definition and encourages people to practice a sport for their entire life, which is a great ideal but to me, it feels a bit short because it doesn’t say much more. There are dynamics, experiences, and learnings that occur during different life stages of the players.</p>\n<p>A few years later, I had the chance to meet a group of young adults that have been playing together since childhood and I found that building lifelong friends through sports is a very noble goal.</p>\n<p>If a group of children practices football from the age of six to adulthood, they not only keep coming every year and they learn but they build lifelong friendships. What a better gift we can give to our children than teammates or friends for their entire life.</p>\n<p>Note that school provides a similar opportunity but there’s a key difference. Football is a game, everything occurs around a ludic experience whether a school is a more complex process.</p>\n<p>I omit the profession children will pick as adults because I don’t believe junior sports should pay attention on generating elite athetles. That’s an outcome, if it’s achieved, fine, if not fine too. There are several reasons for me to believe this, one of them is that <a href=\"https://sportnz.org.nz/media/2374/developing-participants-athletes-sports-leaders-oct-2017.pdf\">Childhood success is not a reliable predictor of future success</a>.</p>\n<h2 id=\"expectations\">Expectations<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h2>\n<p>A football team is part of <a href=\"https://www.bnujfc.co.nz/faq\">a club</a>, <a href=\"https://www.nzfootball.co.nz/juniors\">a federation</a>, and a country. There are implicit and explicit codes that must be followed. The game occurs around the <a href=\"https://www.capitalfootball.org.nz/GET-INVOLVED-1/Competition-Information-1/Competition-Information-4\">Law of the Game</a>, which has to be followed as well.</p>\n<p>Beyond these and if we get into the details of the coaching process, I believe there are two very specific points worth mentioning: <em>equal playing time</em> and <em>position rotation</em>.</p>\n<p>Unfortunately, I lived my childhood before Torbjørn Lorentzen wrote <a href=\"https://www.tandfonline.com/doi/full/10.1080/23265507.2016.1266694?scroll=top&amp;needAccess=true&amp;\"><em>Allocation of playing time within team sports – a problem for discussion</em></a>, so when I was nine years old I had coaches that would left me on the bench for entire games or they would tell me not to bother to come to a match because I wouldn’t play. So, I don’t have to read books to know why is important to take care of every player’s playing time. On the other extreme, I’ve seen coaches taking a clock and making subs on the exact number of seconds that would dictate the maths.</p>\n<p>From the learning perspective, I believe the second criteria may be as bad as the first. It’s obvious that if a player doesn’t play, the player won’t learn and frustration may be high. Now, <em>playing time</em> is a bit more complex than time on the field, more explicitly, position matters. It’s not the same to play as a goalkeeper or striker or as a defender.</p>\n<p>Even at a young age, there are players with a predisposition to different positions. A goalkeeper, for example, is the last in the line. A goalkeeper mistake may easily end up in an opponent’s goal whereas a midfielder mistake may not be that serious in terms of the outcome. Then, it’s not the same to make a player play as a goalkeeper few minutes and then as a striker. And this is a very personal thing, every player is unique and will experience different positions in different ways.</p>\n<p>And it’s not as simple as keeping players in the same position because from the mathematical point of view, the combinatorial problem of the substitutions is so complex that is impossible to find a way to substitute players to guarantee equal playing time and at the same time, assure that players will play in the same positions during a match.</p>\n<p>Solution: fair playing time. I heard this phrase from NZ Men’s U17 Coach and Youth Talent Pathway Manager Martin Bullock and I adopted it as my own. In my own adaptation, the idea is to get as close as possible to equal playing time but keeping in mind players’ positions in such a way that if a player goes to the bench and returns in the same match, the player will play in the same position.</p>\n<p>Still is not a simple math problem to solve and that’s why I’ve been working during the last three years in <a href=\"https://astuten.io/\">a mobile app</a> to assist me with it, but that’s a story for another post.</p>\n<p>Back to expectations, the other criteria I mentioned before is position rotation. As I said before, I don’t think is a good idea to rotate positions within a match so I prefer to rotate just a few times during a season. Position rotation is a must. This is a long subject too and very qualified people gave very good explanations about this. For now let’s just say that early specialisation is not good and every player should be able to play at least two or three different positions on the field.</p>\n<h2 id=\"context\">Context<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h2>\n<p>So many words and I still didn’t say much about the conversation after a child scores or misses in front of the goalpost.</p>\n<p>So, let’s put that event in context. The junior journey takes about seven years. Junior Football goes from six to thirteen years old. From seven to eight, the team has five players on the field. From nine to ten, seven. From eleven to twelve, nine. From thirteen years old, players play eleven a side.</p>\n<p>The journey is long. Does it matter if a child scores or misses a goal when the player is nine years old?</p>\n<p>To me it does because <em>football is the most important of the least important things</em> but what is the best intervention?. Well… if I could answer that question in a few words or even in one post, I wouldn’t need my football notes.</p>\n<p>To be continued.</p>\n<hr>\n<p>Drawing: <strong>A Team of Friends</strong> by <a href=\"https://www.artstation.com/pabloestevez\">Pablo Estevez</a>. Idea by Roberto Allende.</p>",
            "image": "https://en.allende.nz/football/media/posts/2/team-of-friends.jpg",
            "author": {
                "name": "Roberto Allende"
            },
            "tags": [
                   "Success",
                   "Junior Path",
                   "Expectations",
                   "Coach"
            ],
            "date_published": "2022-06-07T14:00:00+12:00",
            "date_modified": "2024-04-14T15:28:35+12:00"
        },
        {
            "id": "https://en.allende.nz/football/a-common-ground-for-amateur-football/",
            "url": "https://en.allende.nz/football/a-common-ground-for-amateur-football/",
            "title": "A common ground for amateur football",
            "summary": "<p>Many things make football a fun game. Bielsa would say it’s because <em>the weak can defeat the powerful</em>. While watching a Rugby match, my friends would say that it’s because <em>football rules are very simple and easy to understand</em>. “El Diego” would say it’s because <em>life goes away</em>.</p>\n<p>Whatever your favorite reason is, there’s always be a collective element in the game. Football is a collective sport and it requires a collective construction.</p>\n",
            "content_html": "<p>Many things make football a fun game. Bielsa would say it’s because <em>the weak can defeat the powerful</em>. While watching a Rugby match, my friends would say that it’s because <em>football rules are very simple and easy to understand</em>. “El Diego” would say it’s because <em>life goes away</em>.</p>\n<p>Whatever your favorite reason is, there’s always be a collective element in the game. Football is a collective sport and it requires a collective construction.</p>\n\n<p>As a football enthusiast, such collective construction requires a common ground. If there is no consensus, conflict or frustration are the usual outcomes.</p>\n<h1 id=\"its-about-values\">It’s about values<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h1>\n<p>By common ground, I mean a set of values. These may be obvious or just ‘common sense’ but after many ‘after game’ conversations I found that the lack of consensus is very common among teams. For that reason, I think it is important to write them down and talk about them. If we are playing together, and I hope we do, these are the ones I believe in. If you don’t agree with them, it’s fine, let’s talk about it and find new common ground.</p>\n<p>This is my list. They’re just four:</p>\n<ol>\n<li>Team must be inclusive</li>\n<li>Don’t believe in good or bad, believe in growth</li>\n<li>Mistakes are allowed</li>\n<li>Play to win</li>\n</ol>\n<h2 id=\"1-a-team-must-be-inclusive\">1. A team must be inclusive<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h2>\n<p>Assuming that</p>\n<ul>\n<li>#1: A football team needs at least eleven, seven, or five players on the field and,</li>\n<li>#2: Every team has players with different levels.</li>\n</ul>\n<p>It simply does not make sense not to be inclusive. It’s a practical thing. Let me show the point with a few examples:</p>\n<p>Let’s say Team A from Hypergalactic Empire Club is lucky enough to gather 15 young and very talented players to play in the <em>Earth Gravity League</em> of Mars Amateur Football Association. Because this is a team just for stars, they exclude five players that want to join the team but they’re not good enough.</p>\n<p>Season stars, Team A wins five matches in a row by at least a ten goals of difference until injuries become a serious thing. So, by the sixth match, the team plays without substitution at all. It’s still a win but because of a new injury in the match, Team A has to play most of the game with ten players. Before the seventh match, two players, who are brothers, decide to take a job in Jupiter and now, Hypergalactic Empire Club’s Team A has to default games.</p>\n<p>Another example, it is common that junior leagues use five aside for a certain age, two years later, they use seven aside and later on nine aside, etc. Similar situation, if you stream <em>more gifted</em> players from the first year, you may experience similar problems as Hypergalactic Club has when the children grow and teams need two more players.</p>\n<p>In a sentence, I believe that football must be inclusive because a team cannot afford the luxury of excluding people.</p>\n<p>Of course, I believe being inclusive is the right thing to do but my point is that even from a pragmatic point of view it doesn’t make sense not to be.</p>\n<h2 id=\"2-dont-believe-in-good-or-bad-believe-in-growth\">2. Don’t believe in good or bad, believe in growth<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h2>\n<p>A professional team needs good and very talented players to win the Champions. If a coach doesn’t win matches, the coach will be sacked. Then winning is a must. The job of a lot of people depends on it.</p>\n<p>Amateur football is different. At least, in theory, nobody will be fired if a team doesn’t win. It may not be fun and you may lose players if you don’t win <strong>but</strong> if there’s growth you may not win today but eventually, you will and the best thing, the team will hold together even with bad scores.</p>\n<p>Growth is a mindset. It’s about believing that anyone can improve. Bad or good is a mindset too, it’s called the <em>fixed mindset</em>, you are either good or bad. In the fixed mindset, imperfections are shameful. The growth mindset says all of these things can be developed. All — you, teammates — are capable of growth and change.</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/1/mindset-2.jpg\" alt=\"\" width=\"2461\" height=\"2182\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/1/responsive/mindset-2-xs.jpg 300w ,https://en.allende.nz/football/media/posts/1/responsive/mindset-2-sm.jpg 480w ,https://en.allende.nz/football/media/posts/1/responsive/mindset-2-md.jpg 768w ,https://en.allende.nz/football/media/posts/1/responsive/mindset-2-lg.jpg 1024w ,https://en.allende.nz/football/media/posts/1/responsive/mindset-2-xl.jpg 1360w ,https://en.allende.nz/football/media/posts/1/responsive/mindset-2-2xl.jpg 1600w\"></figure>\n<figcaption >\n<p><em>Change your mindset poster from Brooklyn Primary School in Wellington, NZ</em></p>\n</figcaption>\n</figure>\n<p> </p>\n<p>The mindset concept is not something new and there are plenty of people who researched and wrote about this topic. Just to mention one, <a href=\"https://www.brainpickings.org/2014/01/29/carol-dweck-mindset/\">Maria Popova’s brainpickings</a> is a very quick introduction to the topic.</p>\n<h2 id=\"3-mistakes-are-allowed\">3. Mistakes are allowed<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h2>\n<p>If you believe in growth, mistakes must be allowed. A mistake is a great teacher. Sometimes is the only way to learn.</p>\n<h2 id=\"4-play-to-win\">4. Play to win<a class=\"anchor d-print-none\" aria-hidden=\"true\"><i class=\"fas fa-anchor\"></i></a></h2>\n<p>In a sports game, the participant must stretch his/her skills to meet the challenge provided by the skills of the opponent. The roots of the word “compete” are the Latin <em>con petire</em>, which meant <em>to seek together.</em> What each person seeks is to actualize his/her potential.</p>\n<p>Leaving the outcome aside means quitting the adventure to seek individual and collective potential.</p>\n<p>I’ve met coaches, especially in the junior space, that <em>hide</em> the score from children because they don’t want to expose them to <em>toxic</em> situations. I agree that if players are not concerned about the score it doesn’t make sense to push them, but if they are aware, I think it is essential to take it as part of the game. Outcomes are a useful learning tool. It gives purpose to the game. It creates a sense of urgency. It helps to learn how to deal with frustration. It helps players and coaches to be better and push boundaries.</p>\n<p>And lastly, it creates situations where we may make mistakes and if we do, we learn.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://en.allende.nz/football/media/posts/1/Screenshot-2024-04-14-at-15.03.00.png\" alt=\"\" width=\"1714\" height=\"430\" sizes=\"100vw\" srcset=\"https://en.allende.nz/football/media/posts/1/responsive/Screenshot-2024-04-14-at-15.03.00-xs.png 300w ,https://en.allende.nz/football/media/posts/1/responsive/Screenshot-2024-04-14-at-15.03.00-sm.png 480w ,https://en.allende.nz/football/media/posts/1/responsive/Screenshot-2024-04-14-at-15.03.00-md.png 768w ,https://en.allende.nz/football/media/posts/1/responsive/Screenshot-2024-04-14-at-15.03.00-lg.png 1024w ,https://en.allende.nz/football/media/posts/1/responsive/Screenshot-2024-04-14-at-15.03.00-xl.png 1360w ,https://en.allende.nz/football/media/posts/1/responsive/Screenshot-2024-04-14-at-15.03.00-2xl.png 1600w\"></figure>",
            "image": "https://en.allende.nz/football/media/posts/1/tewhea.jpg",
            "author": {
                "name": "Roberto Allende"
            },
            "tags": [
                   "Values",
                   "Team Building"
            ],
            "date_published": "2021-09-25T13:00:00+12:00",
            "date_modified": "2024-04-14T15:29:18+12:00"
        }
    ]
}
